<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="google-site-verification" content="xBT4GhYoi5qRD5tr338pgPM5OWHHIDR6mNg1a3euekI" />
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="技术博客">
    <meta name="keyword"  content="Java Python NLP">
    <link rel="shortcut icon" href="/img/favicon.ico">

    <title>
        
          XGBoost - 高明的博客 | GaoMing&#39;s Blog
        
    </title>

    <link rel="canonical" href="http://example.com/2019/09/11/XGBoost/">

    <!-- Bootstrap Core CSS -->
    
<link rel="stylesheet" href="/css/bootstrap.min.css">


    <!-- Custom CSS -->
    
<link rel="stylesheet" href="/css/hux-blog.min.css">


    <!-- Pygments Highlight CSS -->
    
<link rel="stylesheet" href="/css/highlight.css">


    
<link rel="stylesheet" href="/css/toc.css">



    <!-- Custom Fonts -->
    <!-- <link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.3.0/css/font-awesome.min.css" rel="stylesheet" type="text/css"> -->
    <!-- Hux change font-awesome CDN to qiniu -->
    <link href="https://cdn.staticfile.org/font-awesome/4.5.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- Hux Delete, sad but pending in China
    <link href='http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'>
    <link href='http://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/
    css'>
    -->


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script>
<meta name="generator" content="Hexo 5.4.0"></head>


<!-- hack iOS CSS :active style -->
<body ontouchstart="">

    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">Gao Ming’s Blog</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/">Home</a>
                    </li>

                    

                        
                    

                        
                        <li>
                            <a href="/about/">About</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/tags/">Tags</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/archives/">Archives</a>
                        </li>
                        
                    
                    
                </ul>
            </div>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>


    <!-- Main Content -->
    
<!-- Image to hack wechat -->
<!-- <img src="{{ site.baseurl }}/img/icon_wechat.png" width="0" height="0"> -->
<!-- <img src="{{ site.baseurl }}/{% if page.header-img %}{{ page.header-img }}{% else %}{{ site.header-img }}{% endif %}" width="0" height="0"> -->

<!-- Post Header -->
<style type="text/css">
    header.intro-header{
        background-image: url('/img/home-bg.jpg')
    }
</style>
<header class="intro-header" >
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <div class="tags">
                        
                          <a class="tag" href="/tags/#机器学习" title="机器学习">机器学习</a>
                        
                    </div>
                    <h1>XGBoost</h1>
                    <h2 class="subheading">XGBoost</h2>
                    <span class="meta">
                        Posted by 高明 on
                        2019-09-11
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

    <!-- Post Container -->
            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                post-container">

                <h1 id="XGBoost"><a href="#XGBoost" class="headerlink" title="XGBoost"></a>XGBoost</h1><h2 id="&#x7B97;&#x6CD5;&#x601D;&#x60F3;"><a href="#&#x7B97;&#x6CD5;&#x601D;&#x60F3;" class="headerlink" title="&#x7B97;&#x6CD5;&#x601D;&#x60F3;"></a>&#x7B97;&#x6CD5;&#x601D;&#x60F3;</h2><p>&#x5728;&#x51B3;&#x7B56;&#x6811;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x5F80;&#x5DE6;&#x8FB9;&#x5206;&#x6216;&#x8005;&#x5F80;&#x53F3;&#x8FB9;&#x5206;&#xFF0C;&#x6700;&#x7EC8;&#x5230;&#x8FBE;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#xFF0C;&#x8FD9;&#x6837;&#x6765;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x3002; &#x5176;&#x5B9E;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x56DE;&#x5F52;&#x4EFB;&#x52A1;&#x3002;</p>
<p><img src="/2019/09/11/XGBoost/clip_image001.png" alt="&#x662F; &#x5426; &#x73A9; &#x6E38; &#x620F; &#xFF1F;  tree2  &quot; &apos; &#x4E00; 0 e &#x3001; 00 &#x537F; 0 e  &#x6743; &#x91CD; &#x4E00; &#xB7; 2  &#xFF09; &#xFF1A; 2 &#xFF0E; 0 &#xFF0E; 9 &#xFF1A; 2 &#xFF0E; 9 f( &#xFF09; &#xFF1A; &#xFF0E; 1 &#xFF0E; 0 &#xFF0E; 9 &#xFF1A; &#xFF0E; 0 &#xFF0E; 1 "></p>
<p>&#x770B;&#x4E0A;&#x9762;&#x4E00;&#x4E2A;&#x56FE;&#x4F8B;&#x5DE6;&#x8FB9;&#xFF1A;&#x6709;5&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x770B;&#x4E0B;&#x8FD9;5&#x4E2A;&#x4EBA;&#x613F;&#x4E0D;&#x613F;&#x610F;&#x53BB;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x8FD9;5&#x4E2A;&#x4EBA;&#x73B0;&#x5728;&#x90FD;&#x5206;&#x5230;&#x4E86;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x91CC;&#x9762;&#xFF0C;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x5206;&#x914D;&#x4E0D;&#x540C;&#x7684;&#x6743;&#x91CD;&#x9879;&#xFF0C;&#x6B63;&#x6570;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x4EBA;&#x613F;&#x610F;&#x53BB;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x8D1F;&#x6570;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x4EBA;&#x4E0D;&#x613F;&#x610F;&#x53BB;&#x73A9;&#x6E38;&#x620F;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x548C;&#x6743;&#x503C;&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x6765;&#x7EFC;&#x5408;&#x7684;&#x8BC4;&#x5224;&#x5F53;&#x524D;&#x8FD9;&#x4E2A;&#x4EBA;&#x5230;&#x5E95;&#x662F;&#x613F;&#x610F;&#x8FD8;&#x662F;&#x4E0D;&#x613F;&#x610F;&#x53BB;&#x73A9;&#x6E38;&#x620F;&#x3002;&#x4E0A;&#x9762;&#x300C;tree1&#x300D;&#x90A3;&#x4E2A;&#x5C0F;&#x7537;&#x5B69;&#x5B83;&#x6240;&#x5904;&#x7684;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x6743;&#x503C;&#x662F;+2&#xFF08;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x5F97;&#x5206;&#xFF09;&#x3002;</p>
<p>&#x7528;&#x5355;&#x4E2A;&#x51B3;&#x7B56;&#x6811;&#x597D;&#x50CF;&#x6548;&#x679C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x4E0D;&#x662F;&#x592A;&#x597D;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x53EF;&#x80FD;&#x4F1A;&#x592A;&#x7EDD;&#x5BF9;&#x3002;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x4F1A;&#x7528;&#x4E00;&#x79CD;&#x96C6;&#x6210;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x68F5;&#x6811;&#x6548;&#x679C;&#x53EF;&#x80FD;&#x4E0D;&#x592A;&#x597D;&#xFF0C;&#x7528;&#x4E24;&#x68F5;&#x6811;&#x5462;&#xFF1F;</p>
<p>&#x770B;&#x56FE;&#x4F8B;&#x53F3;&#x8FB9;&#x7684;&#x300C;tree2&#x300D;&#xFF0C;&#x5B83;&#x548C;&#x5DE6;&#x8FB9;&#x7684;&#x4E0D;&#x540C;&#x5728;&#x4E8E;&#x5B83;&#x4F7F;&#x7528;&#x4E86;&#x53E6;&#x5916;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x51FA;&#x4E86;&#x5E74;&#x9F84;&#x548C;&#x6027;&#x522B;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x7535;&#x8111;&#x9891;&#x7387;&#x8FD9;&#x4E2A;&#x5212;&#x5206;&#x5C5E;&#x6027;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E24;&#x68F5;&#x6811;&#x5171;&#x540C;&#x5E2E;&#x6211;&#x4EEC;&#x51B3;&#x7B56;&#x5F53;&#x524D;&#x8FD9;&#x4E2A;&#x4EBA;&#x613F;&#x4E0D;&#x613F;&#x610F;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x5C0F;&#x7537;&#x5B69;&#x5728;&#x300C;tree1&#x300D;&#x7684;&#x6743;&#x503C;&#x662F;+2&#xFF0C;&#x5728;&#x300C;tree2&#x300D;&#x7684;&#x6743;&#x503C;&#x662F;+0.9&#xFF0C; &#x6240;&#x4EE5;&#x5C0F;&#x7537;&#x5B69;&#x6700;&#x7EC8;&#x7684;&#x6743;&#x503C;&#x662F;+2.9&#xFF08;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x5F97;&#x5206;&#x662F;+2.9&#xFF09;&#x3002;&#x8001;&#x7237;&#x7237;&#x6700;&#x7EC8;&#x7684;&#x6743;&#x503C;&#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x6837;&#x7684;&#x8FC7;&#x7A0B;&#x5F97;&#x5230;&#x7684;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5728;&#x505A;&#x5206;&#x7C7B;&#x6216;&#x8005;&#x56DE;&#x5F52;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x60F3;&#x4E00;&#x60F3;&#x4E00;&#x65E6;&#x9009;&#x62E9;&#x7528;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x53EF;&#x80FD;&#x8868;&#x8FBE;&#x6548;&#x679C;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x8003;&#x8651;&#x7528;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x96C6;&#x6210;&#x7684;&#x601D;&#x60F3;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x56FE;&#x4F8B;&#x53EA;&#x662F;&#x4E3E;&#x4E86;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5176;&#x5B9E;&#x8FD8;&#x53EF;&#x4EE5;&#x6709;&#x66F4;&#x591A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4E00;&#x8D77;&#x7EC4;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x5F3A;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<h2 id="XGBoost&#x539F;&#x7406;"><a href="#XGBoost&#x539F;&#x7406;" class="headerlink" title="XGBoost&#x539F;&#x7406;"></a>XGBoost&#x539F;&#x7406;</h2><p>XGBoost&#x7684;&#x96C6;&#x6210;&#x8868;&#x793A;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x600E;&#x4E48;&#x9884;&#x6D4B;&#xFF1F;&#x6C42;&#x6700;&#x4F18;&#x89E3;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x770B;&#x4E0B;&#x56FE;&#x7684;&#x8BF4;&#x660E;&#x4F60;&#x5C31;&#x80FD;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x3002;</p>
<p><img src="/2019/09/11/XGBoost/clip_image001-16363622751731.png" alt="xgboost "></p>
<p>&#x5728;XGBoost&#x91CC;&#xFF0C;&#x6BCF;&#x68F5;&#x6811;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x5F80;&#x91CC;&#x9762;&#x52A0;&#x7684;&#xFF0C;&#x6BCF;&#x52A0;&#x4E00;&#x4E2A;&#x90FD;&#x662F;&#x5E0C;&#x671B;&#x6548;&#x679C;&#x80FD;&#x591F;&#x63D0;&#x5347;&#xFF0C;&#x4E0B;&#x56FE;&#x5C31;&#x662F;XGBoost&#x8FD9;&#x4E2A;&#x96C6;&#x6210;&#x7684;&#x8868;&#x793A;&#xFF08;&#x6838;&#x5FC3;)&#x3002;</p>
<p><img src="/2019/09/11/XGBoost/clip_image003.png" alt="xgboost&#x6A21;&#x578B;&#x56FE;"></p>
<p>&#x4E00;&#x5F00;&#x59CB;&#x6811;&#x662F;0&#xFF0C;&#x7136;&#x540E;&#x5F80;&#x91CC;&#x9762;&#x52A0;&#x6811;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x518D;&#x52A0;&#x7B2C;&#x4E8C;&#x68F5;&#x6811;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x53C8;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x2026;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x52A0;&#x5165;&#x65B0;&#x7684;&#x51FD;&#x6570;&#x80FD;&#x591F;&#x63D0;&#x5347;&#x6574;&#x4F53;&#x5BF9;&#x8868;&#x8FBE;&#x6548;&#x679C;&#x3002;&#x63D0;&#x5347;&#x8868;&#x8FBE;&#x6548;&#x679C;&#x7684;&#x610F;&#x601D;&#x5C31;&#x662F;&#x8BF4;&#x52A0;&#x4E0A;&#x65B0;&#x7684;&#x6811;&#x4E4B;&#x540E;&#xFF0C;&#x76EE;&#x6807;&#x51FD;&#x6570;&#xFF08;&#x5C31;&#x662F;&#x635F;&#x5931;&#xFF09;&#x7684;&#x503C;&#x4F1A;&#x4E0B;&#x964D;&#x3002;</p>
<p>&#x5982;&#x679C;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x4E2A;&#x6570;&#x592A;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;&#x4F1A;&#x8D8A;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x8981;&#x9650;&#x5236;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x4E2A;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x539F;&#x6765;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x91CC;&#x8981;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x60E9;&#x7F5A;&#x9879;&#x300C;omega(ft)&#x300D;&#x3002;</p>
<p><img src="/2019/09/11/XGBoost/clip_image004.png" alt="&#x60E9; &#x7F5A; &#x529B; &#x5EA6;  Q(ft)  &#x53F6; &#x5B50; &#x7684; &#x4E2A;  L2 &#x60E9; &#x7F5A; &#x9879;  &#x53F6; &#x5B50; &#x7ED3; &#x70B9;  &#x7684; &#x6743; &#x91CD; "></p>
<p>&#x8FD9;&#x91CC;&#x4E3E;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x770B;&#x770B;&#x60E9;&#x7F5A;&#x9879;&#x300C;omega(ft)&#x300D;&#x662F;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x7684;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image005.png" alt="is male?  Leaf 1  Leaf 2  w2=o.1  Leaf 3  W3=-1 "></p>
<p>&#x4E00;&#x5171;3&#x4E2A;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#xFF0C;&#x6743;&#x91CD;&#x5206;&#x522B;&#x662F;2&#xFF0C;0.1&#xFF0C;-1&#xFF0C;&#x5E26;&#x5165;&#x300C;omega(ft)&#x300D;&#x4E2D;&#x5C31;&#x5F97;&#x5230;&#x4E0A;&#x9762;&#x56FE;&#x4F8B;&#x7684;&#x5F0F;&#x5B50;&#xFF0C;&#x60E9;&#x7F5A;&#x529B;&#x5EA6;&#x548C;&#x300C;lambda&#x300D;&#x7684;&#x503C;&#x4EBA;&#x4E3A;&#x7ED9;&#x5B9A;&#x3002;</p>
<p>XGBoost&#x7B97;&#x6CD5;&#x5B8C;&#x6574;&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x89C1;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#xFF0C;&#x5B83;&#x7531;&#x81EA;&#x8EAB;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x548C;&#x6B63;&#x5219;&#x5316;&#x60E9;&#x7F5A;&#x9879;&#x300C;omega(ft)&#x300D;&#x76F8;&#x52A0;&#x800C;&#x6210;&#x3002;</p>
<p><img src="/2019/09/11/XGBoost/clip_image006.png" alt="Obj(t)  i=ll Yi,Yi  + ft(Xi) + t + constant "></p>
<p>&#x4E0A;&#x56FE;&#x4E2D;&#x7684;constant&#x5C31;&#x662F;&#x524D;t-1&#x68F5;&#x6811;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x518D;&#x5FCD;&#x8010;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x8861;&#x91CF;&#x6811;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E86;&#xFF0C;&#x6682;&#x65F6;&#x5FFD;&#x7565;&#x5B83;&#x3002;</p>
<p>&#x5047;&#x5982;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;MSE&#xFF0C;&#x90A3;&#x4E48;&#x4E0A;&#x8FF0;&#x8868;&#x8FBE;&#x5F0F;&#x4F1A;&#x53D8;&#x6210;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image007.png" alt="A(t-l)  obj(t)  E(Yi &#x2014; (yt  + + E Q(fi)  &#x2014; + + Q(ft) + constant "></p>
<p>&#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#x975E;&#x5E38;&#x6F02;&#x4EAE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x542B;&#x6709;f_t(x_i)&#x7684;&#x4E00;&#x6B21;&#x5F0F;&#x548C;&#x4E8C;&#x6B21;&#x5F0F;&#xFF0C;&#x800C;&#x4E14;&#x4E00;&#x6B21;&#x5F0F;&#x9879;&#x7684;&#x7CFB;&#x6570;&#x662F;&#x6B8B;&#x5DEE;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x597D;&#x5947;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x4E00;&#x6B21;&#x5F0F;&#x548C;&#x4E8C;&#x6B21;&#x5F0F;&#x5C31;&#x6F02;&#x4EAE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F1A;&#x5BF9;&#x6211;&#x4EEC;&#x540E;&#x7EED;&#x7684;&#x4F18;&#x5316;&#x63D0;&#x4F9B;&#x5F88;&#x591A;&#x65B9;&#x4FBF;&#xFF0C;&#x7EE7;&#x7EED;&#x524D;&#x8FDB;&#x4F60;&#x5C31;&#x660E;&#x767D;&#x4E86;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5B83;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x7684;&#x67D0;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x503C;&#x3002;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x503C;&#x662F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x6A21;&#x578B;&#x7684;&#x53C2;&#x6570;&#x7684;</p>
<p>&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x672A;&#x5FC5;&#x80FD;&#x5F97;&#x51FA;&#x5982;&#x6B64;&#x6F02;&#x4EAE;&#x7684;&#x5F0F;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x822C;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5176;&#x4F5C;&#x6CF0;&#x52D2;&#x4E8C;&#x9636;&#x5C55;&#x5F00;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p>![n  obj(t) &#x2014;  1  &#x2014;hift2@i)] -4- Q(ft) -4- constant  2 ](file:///C:/Users/gaoming/AppData/Local/Temp/msohtmlclip1/01/clip_image009.png)</p>
<p>&#x5176;&#x4E2D;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image010.png" alt="img"></p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x5FC5;&#x8981;&#x518D;&#x660E;&#x786E;&#x4E00;&#x4E0B;&#xFF0C;&#x548C;&#x7684;&#x542B;&#x4E49;&#x3002;&#x600E;&#x4E48;&#x7406;&#x89E3;&#x5462;&#xFF1F;&#x73B0;&#x6709;t-1&#x68F5;&#x6811;&#x662F;&#x4E0D;&#x662F;&#xFF1F;&#x8FD9;t-1&#x68F5;&#x6811;&#x7EC4;&#x6210;&#x7684;&#x6A21;&#x578B;&#x5BF9;&#x7B2C;i&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x6709;&#x4E00;&#x4E2A;&#x9884;&#x6D4B;&#x503C;&#x662F;&#x4E0D;&#x662F;&#xFF1F;&#x8FD9;&#x4E2A;&#x4E0E;&#x7B2C;i&#x4E2A;&#x6837;&#x672C;&#x7684;&#x771F;&#x5B9E;&#x6807;&#x7B7E;&#x80AF;&#x5B9A;&#x6709;&#x5DEE;&#x8DDD;&#x662F;&#x4E0D;&#x662F;&#xFF1F;&#x8FD9;&#x4E2A;&#x5DEE;&#x8DDD;&#x53EF;&#x4EE5;&#x7528;,)&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x6765;&#x8861;&#x91CF;&#x662F;&#x4E0D;&#x662F;&#xFF1F;&#x73B0;&#x5728;&#x548C;&#x7684;&#x542B;&#x4E49;&#x4F60;&#x5DF2;&#x7ECF;&#x6E05;&#x695A;&#x4E86;&#x662F;&#x4E0D;&#x662F;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x662F;&#x89C9;&#x5F97;&#x62BD;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x4F18;&#x5316;&#x7B2C;11&#x68F5;CART&#x6811;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x524D;10&#x68F5; CART&#x6811;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;&#x4E86;&#x3002;&#x8FD9;10&#x68F5;&#x6811;&#x5BF9;&#x6837;&#x672C;(=1)&#x7684;&#x9884;&#x6D4B;&#x503C;&#x662F;=-1&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x662F;&#x505A;&#x5206;&#x7C7B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;</p>
<p><img src="/2019/09/11/XGBoost/clip_image013.png" alt="L(O) E [Yi In(l + e&#xAF;ji) + (I &#x2014; yt&#x2022;) In(l + e&#xFB;t)] "></p>
<p>&#x5728;=1&#x65F6;&#xFF0C;&#x635F;&#x5931;&#x51FD;&#x6570;&#x53D8;&#x6210;&#x4E86;</p>
<p><img src="/2019/09/11/XGBoost/clip_image015.png" alt="G &#x3001; &#x4E28; 3 &#x5341; I)tq "></p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6C42;&#x51FA;&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5BF9;&#x4E8E;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image017.png" alt="img"></p>
<p>&#x5C06; =-1&#x4EE3;&#x5165;&#x4E0A;&#x9762;&#x7684;&#x5F0F;&#x5B50;&#xFF0C;&#x8BA1;&#x7B97;&#x5F97;&#x5230;-0.27&#x3002;&#x8FD9;&#x4E2A;-0.27&#x5C31;&#x662F;&#x3002;&#x8BE5;&#x503C;&#x662F;&#x8D1F;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x51CF;&#x5C0F;&#x8FD9;10&#x68F5;&#x6811;&#x5728;&#x8BE5;&#x6837;&#x672C;&#x70B9;&#x4E0A;&#x7684;&#x9884;&#x6D4B;&#x635F;&#x5931;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x6CBF;&#x7740;&#x68AF;&#x5EA6;&#x7684;&#x53CD;&#x65B9;&#x5411;&#x53BB;&#x8D70;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8981;&#x589E;&#x5927;&#x7684;&#x503C;,&#x4F7F;&#x5176;&#x8D8B;&#x5411;&#x4E8E;&#x6B63;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;=1&#x5C31;&#x662F;&#x6B63;&#x7684;</p>
<p>&#x6765;&#xFF0C;&#x7B54;&#x4E00;&#x4E2A;&#x5C0F;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x4F18;&#x5316;&#x7B2C;t&#x68F5;&#x6811;&#x65F6;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x548C;&#x8981;&#x8BA1;&#x7B97;&#xFF1F;&#x55EF;&#xFF0C;&#x6CA1;&#x9519;&#x5C31;&#x662F;&#x5404;&#x6709;N&#x4E2A;&#xFF0C;N&#x662F;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x7684;&#x6570;&#x91CF;&#x3002;&#x5982;&#x679C;&#x6709;10&#x4E07;&#x6837;&#x672C;&#xFF0C;&#x5728;&#x4F18;&#x5316;&#x7B2C;t&#x68F5;&#x6811;&#x65F6;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x51FA;&#x4E2A;10&#x4E07;&#x4E2A;&#x548C;&#x3002;&#x611F;&#x89C9;&#x597D;&#x50CF;&#x5F88;&#x9EBB;&#x70E6;&#x662F;&#x4E0D;&#x662F;&#xFF1F;&#x4F46;&#x662F;&#x4F60;&#x518D;&#x60F3;&#x4E00;&#x60F3;&#xFF0C;&#x8FD9;10&#x4E07;&#x4E2A;&#x4E4B;&#x95F4;&#x662F;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x5565;&#x5173;&#x7CFB;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x5462;&#xFF1F;&#x806A;&#x660E;&#x7684;&#x4F60;&#x60F3;&#x5FC5;&#x518D;&#x4E00;&#x6B21;&#x611F;&#x53D7;&#x5230;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;xgboost&#x4F1A;&#x8FA3;&#x4E48;&#x5FEB;&#xFF01;</p>
<p><img src="/2019/09/11/XGBoost/clip_image001-16363625482084.png" alt="img"></p>
<p>&#x597D;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x5BA1;&#x89C6;&#x4E0B;&#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x5E38;&#x91CF;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x53D8;&#x91CF;&#x3002;&#x5F0F;&#x5B50;&#x6700;&#x540E;&#x6709;&#x4E00;&#x4E2A;constant&#x9879;&#xFF0C;&#x806A;&#x660E;&#x5982;&#x4F60;&#xFF0C;&#x80AF;&#x5B9A;&#x731C;&#x5230;&#x4E86;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x524D;t-1&#x68F5;&#x6811;&#x7684;&#x6B63;&#x5219;&#x5316;&#x9879;&#x3002;(,)&#x4E5F;&#x662F;&#x5E38;&#x6570;&#x9879;&#x3002;&#x5269;&#x4E0B;&#x7684;&#x4E09;&#x4E2A;&#x53D8;&#x91CF;&#x9879;&#x5206;&#x522B;&#x662F;&#x7B2C;t&#x68F5;CART&#x6811;&#x7684;&#x4E00;&#x6B21;&#x5F0F;&#xFF0C;&#x4E8C;&#x6B21;&#x5F0F;&#xFF0C;&#x548C;&#x6574;&#x68F5;&#x6811;&#x7684;&#x6B63;&#x5219;&#x5316;&#x9879;&#x3002;&#x518D;&#x6B21;&#x63D0;&#x9192;&#xFF0C;&#x8FD9;&#x91CC;&#x6240;&#x8C13;&#x7684;&#x6811;&#x7684;&#x4E00;&#x6B21;&#x5F0F;&#xFF0C;&#x4E8C;&#x6B21;&#x5F0F;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x67D0;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x503C;&#x7684;&#x4E00;&#x6B21;&#x5F0F;&#xFF0C;&#x4E8C;&#x6B21;&#x5F0F;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8BA9;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x6700;&#x5C0F;&#x5316;&#xFF0C;&#x5E38;&#x6570;&#x9879;&#x663E;&#x7136;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x4EEC;&#x53BB;&#x6389;&#xFF0C;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image021.png" alt="img"></p>
<p>&#x597D;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x56DE;&#x7B54;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E00;&#x6B21;&#x5F0F;&#x548C;&#x4E8C;&#x6B21;&#x5F0F;&#x663E;&#x5F97;&#x90A3;&#x4E48;&#x6F02;&#x4EAE;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x4E00;&#x6B21;&#x5F0F;&#x548C;&#x4E8C;&#x6B21;&#x5F0F;&#x7684;&#x7CFB;&#x6570;&#x662F;&#x548C;&#xFF0C;&#x800C;&#x548C;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x5730;&#x6C42;&#x51FA;&#x6765;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x548C;&#x662F;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x5F62;&#x5F0F;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x8FD9;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E8C;&#x6B21;&#x53EF;&#x5FAE;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8FD9;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#x5462;&#xFF1F;&#x597D;&#x5904;&#x5C31;&#x662F;xgboost&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x81EA;&#x5B9A;&#x4E49;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x53EA;&#x9700;&#x6EE1;&#x8DB3;&#x4E8C;&#x6B21;&#x53EF;&#x5FAE;&#x5373;&#x53EF;&#x3002;</p>
<h2 id="&#x6A21;&#x578B;&#x6B63;&#x5219;&#x5316;&#x9879;"><a href="#&#x6A21;&#x578B;&#x6B63;&#x5219;&#x5316;&#x9879;" class="headerlink" title="&#x6A21;&#x578B;&#x6B63;&#x5219;&#x5316;&#x9879;"></a>&#x6A21;&#x578B;&#x6B63;&#x5219;&#x5316;&#x9879;</h2><p>&#x4E0A;&#x9762;&#x7684;&#x5F0F;&#x5B50;&#x5DF2;&#x7136;&#x5F88;&#x6F02;&#x4EAE;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x3A9;(ft)&#x4ECD;&#x7136;&#x662F;&#x4E91;&#x906E;&#x96FE;&#x7F69;&#xFF0C;&#x4E0D;&#x6E05;&#x4E0D;&#x695A;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x5B9A;&#x4E49;&#x5982;&#x4F55;&#x8861;&#x91CF;&#x4E00;&#x68F5;&#x6811;&#x7684;&#x6B63;&#x5219;&#x5316;&#x9879;&#x3002;&#x8FD9;&#x4E2A;&#x4E8B;&#x513F;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x5BA2;&#x89C2;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x53EF;&#x4EE5;&#x89C1;&#x4EC1;&#x89C1;&#x667A;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x5BF9;CART&#x6811;&#x4F5C;&#x53E6;&#x4E00;&#x756A;&#x5B9A;&#x4E49;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image023.png" alt="ft(x) e RT , q : Rd -i {1, "></p>
<p>&#x9700;&#x8981;&#x89E3;&#x91CA;&#x4E0B;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x4E00;&#x68F5;&#x6811;&#x6709;T&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;T&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x503C;&#x7EC4;&#x6210;&#x4E86;&#x4E00;&#x4E2A;T&#x7EF4;&#x5411;&#x91CF;w&#xFF0C;q(x)&#x662F;&#x4E00;&#x4E2A;&#x6620;&#x5C04;&#xFF0C;&#x7528;&#x6765;&#x5C06;&#x6837;&#x672C;&#x6620;&#x5C04;&#x6210;1&#x5230;T&#x7684;&#x67D0;&#x4E2A;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x628A;&#x5B83;&#x5206;&#x5230;&#x67D0;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#xFF0C;q(x)&#x5176;&#x5B9E;&#x5C31;&#x4EE3;&#x8868;&#x4E86;CART&#x6811;&#x7684;&#x7ED3;&#x6784;&#x3002;w_q(x)&#x81EA;&#x7136;&#x5C31;&#x662F;&#x8FD9;&#x68F5;&#x6811;&#x5BF9;&#x6837;&#x672C;x&#x7684;&#x9884;&#x6D4B;&#x503C;&#x4E86;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#xFF0C;xgboost&#x5C31;&#x4F7F;&#x7528;&#x4E86;&#x5982;&#x4E0B;&#x7684;&#x6B63;&#x5219;&#x5316;&#x9879;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image024.png" alt="img"></p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x8FD9;&#x91CC;&#x51FA;&#x73B0;&#x4E86;&#x3B3;&#x548C;&#x3BB;&#xFF0C;&#x8FD9;&#x662F;xgboost&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x5728;&#x4F7F;&#x7528;xgboost&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x5B9A;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#xFF0C;&#x663E;&#x7136;&#xFF0C;&#x3B3;&#x8D8A;&#x5927;&#xFF0C;&#x8868;&#x793A;&#x8D8A;&#x5E0C;&#x671B;&#x83B7;&#x5F97;&#x7ED3;&#x6784;&#x7B80;&#x5355;&#x7684;&#x6811;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x65F6;&#x5BF9;&#x8F83;&#x591A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x6811;&#x7684;&#x60E9;&#x7F5A;&#x8D8A;&#x5927;&#x3002;&#x3BB;&#x8D8A;&#x5927;&#x4E5F;&#x662F;&#x8D8A;&#x5E0C;&#x671B;&#x83B7;&#x5F97;&#x7ED3;&#x6784;&#x7B80;&#x5355;&#x7684;&#x6811;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;xgboost&#x8981;&#x9009;&#x62E9;&#x8FD9;&#x6837;&#x7684;&#x6B63;&#x5219;&#x5316;&#x9879;&#xFF1F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x597D;&#x4F7F;&#xFF01;&#x6548;&#x679C;&#x597D;&#x624D;&#x662F;&#x771F;&#x7684;&#x597D;&#x3002;</p>
<h2 id="&#x89C1;&#x8BC1;&#x5947;&#x8FF9;&#x7684;&#x65F6;&#x523B;"><a href="#&#x89C1;&#x8BC1;&#x5947;&#x8FF9;&#x7684;&#x65F6;&#x523B;" class="headerlink" title="&#x89C1;&#x8BC1;&#x5947;&#x8FF9;&#x7684;&#x65F6;&#x523B;"></a>&#x89C1;&#x8BC1;&#x5947;&#x8FF9;&#x7684;&#x65F6;&#x523B;</h2><p>&#x81F3;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5173;&#x4E8E;&#x7B2C;t&#x68F5;&#x6811;&#x7684;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x5DF2;&#x7136;&#x5F88;&#x6E05;&#x6670;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5BF9;&#x5B83;&#x505A;&#x5982;&#x4E0B;&#x53D8;&#x5F62;&#xFF0C;&#x8BF7;&#x7741;&#x5927;&#x53CC;&#x773C;&#xFF0C;&#x96C6;&#x4E2D;&#x7CBE;&#x529B;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image001-16363624953173.png" alt="obj"></p>
<p>&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x505C;&#x4E00;&#x505C;&#xFF0C;&#x8BA4;&#x771F;&#x4F53;&#x4F1A;&#x4E0B;&#x3002;&#x4EE3;&#x8868;&#x4EC0;&#x4E48;&#xFF1F;&#x5B83;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x96C6;&#x5408;&#x4E2D;&#x6BCF;&#x4E2A;&#x503C;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x7684;&#x5E8F;&#x53F7;&#xFF0C;&#x6574;&#x4E2A;&#x96C6;&#x5408;&#x5C31;&#x662F;&#x88AB;&#x7B2C;t&#x68F5;CART&#x6811;&#x5206;&#x5230;&#x4E86;&#x7B2C;j&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x3002;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x518D;&#x770B;&#x8FD9;&#x6B65;&#x8F6C;&#x6362;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5185;&#x5916;&#x6C42;&#x548C;&#x987A;&#x5E8F;&#x7684;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x5982;&#x4E0B;&#x7B80;&#x5316;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image001-16363624637542.png" alt="xgboost&#x4F18;&#x5316;"></p>
<p>&#x5176;&#x4E2D;&#x7684;&#x548C;&#x5E94;&#x5F53;&#x662F;&#x4E0D;&#x8A00;&#x81EA;&#x660E;&#x4E86;&#x3002;<img src="/2019/09/11/XGBoost/clip_image028.png" alt="img"></p>
<p>&#x5BF9;&#x4E8E;&#x7B2C;t&#x68F5;CART&#x6811;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#x7ED3;&#x6784;&#xFF08;&#x53EF;&#x7528;q(x)&#x8868;&#x793A;&#xFF09;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x548C;&#x90FD;&#x662F;&#x786E;&#x5B9A;&#x7684;&#x3002;&#x800C;&#x4E14;&#x4E0A;&#x5F0F;&#x4E2D;&#x5404;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x503C;&#x4E4B;&#x95F4;&#x662F;&#x4E92;&#x76F8;&#x72EC;&#x7ACB;&#x7684;&#x3002;&#x4E0A;&#x5F0F;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E8C;&#x6B21;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x6C42;&#x51FA;&#x5404;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x6700;&#x4F73;&#x503C;&#x4EE5;&#x53CA;&#x6B64;&#x65F6;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x7684;&#x503C;</p>
<p><img src="/2019/09/11/XGBoost/clip_image030.png" alt="(22  2  7 "></p>
<p>obj&#x4EE3;&#x8868;&#x4E86;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x5B83;&#x8868;&#x793A;&#x4E86;&#x8FD9;&#x68F5;&#x6811;&#x7684;&#x7ED3;&#x6784;&#x6709;&#x591A;&#x597D;&#xFF0C;&#x503C;&#x8D8A;&#x5C0F;&#xFF0C;&#x4EE3;&#x8868;&#x8FD9;&#x6837;&#x7ED3;&#x6784;&#x8D8A;&#x597D;&#xFF01;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5B83;&#x662F;&#x8861;&#x91CF;&#x7B2C;t&#x68F5;CART&#x6811;&#x7684;&#x7ED3;&#x6784;&#x597D;&#x574F;&#x7684;&#x6807;&#x51C6;&#x3002;&#x6CE8;&#x610F;<del>&#x6CE8;&#x610F;</del>&#x6CE8;&#x610F;~&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x4EC5;&#x4EC5;&#x662F;&#x7528;&#x6765;&#x8861;&#x91CF;&#x7ED3;&#x6784;&#x7684;&#x597D;&#x574F;&#x7684;&#xFF0C;&#x4E0E;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x503C;&#x53EF;&#x662F;&#x65E0;&#x5173;&#x7684;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x8BF7;&#x518D;&#x4ED4;&#x7EC6;&#x770B;&#x4E00;&#x4E0B;obj&#x7684;&#x63A8;&#x5BFC;&#x8FC7;&#x7A0B;&#x3002;obj&#x53EA;&#x548C;&#x548C;&#x548C;T&#x6709;&#x5173;&#xFF0C;&#x800C;&#x5B83;&#x4EEC;&#x53C8;&#x53EA;&#x548C;&#x6811;&#x7684;&#x7ED3;&#x6784;(q(x))&#x6709;&#x5173;&#xFF0C;&#x4E0E;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x503C;&#x53EF;&#x662F;&#x534A;&#x6BDB;&#x5173;&#x7CFB;&#x6CA1;&#x6709;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image032.png" alt="&#x68AF; &#x5EA6; &#x6570; &#x636E;  N  Y  1  is male?  / 3 &#xFF1A; { 2 &#xFF0C; 3 &#xFF0C; 5 }  N  2  G3 = g2 + 93 + 95  g2, h2  &#xFF1A; { 4 } 113 &#xFF1A; &#x4E94; 2 + &#x7256; +  / 2  &#x6837; &#x672C; &#x70B9; &#x4E00; / 1  G2 = 94  / Gl  3  = 91  &#x68AF; &#x5EA6; &#x6570; &#x636E; &#x4E36; HI  = &#x4E94; 1  4  g4 &#xFF0C; h4  2  &#x8A01; &#x4E65; &#x4E3F; &#x7D1C; +  Obj =  5  g5 &#xFF0C; h5  &#x8FD9; &#x4E2A; &#x5206; &#x6570; &#x8D8A; &#x5C0F; &#xFF0C; &#x4EE3; &#x8868; &#x8FD9; &#x4E2A; &#x6811; &#x7684; &#x7ED3; &#x6784; &#x8D8A; &#x597D; "></p>
<p>Note&#xFF1A;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x76F4;&#x89C9;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x4EE5;&#x4FBF;&#x80FD;&#x83B7;&#x5F97;&#x611F;&#x6027;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x5206;&#x5230;j&#x8FD9;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x6837;&#x672C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5C31;&#x53D8;&#x6210;&#x5982;&#x4E0B;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image034.png" alt="img"></p>
<p>&#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x7684;&#x6700;&#x4F73;&#x503C;&#x5C31;&#x662F;&#x8D1F;&#x7684;&#x68AF;&#x5EA6;&#x4E58;&#x4EE5;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#x7CFB;&#x6570;&#xFF0C;&#x8BE5;&#x7CFB;&#x6570;&#x7C7B;&#x4F3C;&#x4E8E;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4E2D;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x3002;&#x89C2;&#x5BDF;&#x8FD9;&#x4E2A;&#x6743;&#x91CD;&#x7CFB;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x8D8A;&#x5927;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x6570;&#x8D8A;&#x5C0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5B66;&#x4E60;&#x7387;&#x8D8A;&#x5C0F;&#x3002;&#x8D8A;&#x5927;&#x4EE3;&#x8868;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x4EE3;&#x8868;&#x5728;&#x8BE5;&#x70B9;&#x9644;&#x8FD1;&#x68AF;&#x5EA6;&#x53D8;&#x5316;&#x975E;&#x5E38;&#x5267;&#x70C8;&#xFF0C;&#x53EF;&#x80FD;&#x53EA;&#x8981;&#x4E00;&#x70B9;&#x70B9;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x68AF;&#x5EA6;&#x5C31;&#x4ECE;10000&#x53D8;&#x5230;&#x4E86;1&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6B64;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4F7F;&#x7528;&#x53CD;&#x5411;&#x68AF;&#x5EA6;&#x66F4;&#x65B0;&#x65F6;&#x6B65;&#x5B50;&#x5C31;&#x8981;&#x5C0F;&#x800C;&#x53C8;&#x5C0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6743;&#x91CD;&#x7CFB;&#x6570;&#x8981;&#x66F4;&#x5C0F;&#x3002;</p>
<p>7&#x3001;&#x627E;&#x51FA;&#x6700;&#x4F18;&#x7684;&#x6811;&#x7ED3;&#x6784;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x6709;&#x4E86;&#x8BC4;&#x5224;&#x6811;&#x7684;&#x7ED3;&#x6784;&#x597D;&#x574F;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5148;&#x6C42;&#x6700;&#x4F73;&#x7684;&#x6811;&#x7ED3;&#x6784;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B9A;&#x51FA;&#x6765;&#x540E;&#xFF0C;&#x6700;&#x4F73;&#x7684;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x7684;&#x503C;&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x4E0A;&#x9762;&#x5DF2;&#x7ECF;&#x6C42;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x6811;&#x7684;&#x7ED3;&#x6784;&#x8FD1;&#x4E4E;&#x65E0;&#x9650;&#x591A;&#xFF0C;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x53BB;&#x6D4B;&#x7B97;&#x5B83;&#x4EEC;&#x7684;&#x597D;&#x574F;&#x7A0B;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53D6;&#x6700;&#x597D;&#x7684;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x91C7;&#x53D6;&#x4E00;&#x70B9;&#x7B56;&#x7565;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x9010;&#x6B65;&#x5B66;&#x4E60;&#x51FA;&#x6700;&#x4F73;&#x7684;&#x6811;&#x7ED3;&#x6784;&#x3002;&#x8FD9;&#x4E0E;&#x6211;&#x4EEC;&#x5C06;K&#x68F5;&#x6811;&#x7684;&#x6A21;&#x578B;&#x5206;&#x89E3;&#x6210;&#x4E00;&#x68F5;&#x4E00;&#x68F5;&#x6811;&#x6765;&#x5B66;&#x4E60;&#x662F;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x4ECE;&#x4E00;&#x68F5;&#x4E00;&#x68F5;&#x6811;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x5C42;&#x4E00;&#x5C42;&#x8282;&#x70B9;&#x800C;&#x5DF2;&#x3002;&#x5982;&#x679C;&#x6B64;&#x65F6;&#x4F60;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x8499;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x5177;&#x4F53;&#x7684;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4EE5;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#x8FC7;&#x7684;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x4EBA;&#x662F;&#x5426;&#x559C;&#x6B22;&#x8BA1;&#x7B97;&#x673A;&#x6E38;&#x620F;&#x4E3A;&#x4F8B;&#x5B50;&#x3002;&#x6700;&#x7B80;&#x5355;&#x7684;&#x6811;&#x7ED3;&#x6784;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6811;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7B97;&#x51FA;&#x8FD9;&#x68F5;&#x5355;&#x8282;&#x70B9;&#x7684;&#x6811;&#x7684;&#x597D;&#x574F;&#x7A0B;&#x5EA6;obj&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x60F3;&#x6309;&#x7167;&#x5E74;&#x9F84;&#x5C06;&#x8FD9;&#x68F5;&#x5355;&#x8282;&#x70B9;&#x6811;&#x8FDB;&#x884C;&#x5206;&#x53C9;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x77E5;&#x9053;&#xFF1A;</p>
<p>1&#x3001;&#x6309;&#x7167;&#x5E74;&#x9F84;&#x5206;&#x662F;&#x5426;&#x6709;&#x6548;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x662F;&#x5426;&#x51CF;&#x5C11;&#x4E86;obj&#x7684;&#x503C;</p>
<p>2&#x3001;&#x5982;&#x679C;&#x53EF;&#x5206;&#xFF0C;&#x90A3;&#x4E48;&#x4EE5;&#x54EA;&#x4E2A;&#x5E74;&#x9F84;&#x503C;&#x6765;&#x5206;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x56DE;&#x7B54;&#x4E0A;&#x9762;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E00;&#x5BB6;&#x4E94;&#x53E3;&#x4EBA;&#x6309;&#x7167;&#x5E74;&#x9F84;&#x505A;&#x4E2A;&#x6392;&#x5E8F;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image036.png" alt="gl,hl  g4, h4  GL 91 + g4  0  g5,h5 g3, h3  GR 92 + 93 + 95 "></p>
<p>&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x56FE;&#x4ECE;&#x5DE6;&#x81F3;&#x53F3;&#x626B;&#x63CF;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x627E;&#x51FA;&#x6240;&#x6709;&#x7684;&#x5207;&#x5206;&#x70B9;&#xFF0C;&#x5373;&#x904D;&#x5386;&#x6240;&#x6709;&#x5206;&#x5272;&#xFF0C;&#x9009;&#x62E9;&#x53D8;&#x5316;&#x6700;&#x5927;&#x7684;&#x4F5C;&#x4E3A;&#x6700;&#x5408;&#x9002;&#x7684;&#x5206;&#x5272;&#x3002;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#x5207;&#x5206;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x8861;&#x91CF;&#x5207;&#x5206;&#x597D;&#x574F;&#x7684;&#x6807;&#x51C6;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2019/09/11/XGBoost/clip_image037.png" alt="&#x7C7B; &#x4F3C; &#x51B3; &#x7B56; &#x6811; &#x4E2D; &#x7684;  &#x4FE1; &#x606F; &#x589E; &#x76CA; &#x7684; &#x4F5C; &#x7528;  &#x5212; &#x5206; &#x540E;  &#x5212; &#x5206; &#x524D; &#x52A0; &#x5165; &#x65B0; &#x53F6; &#x5B50; &#x8282; &#x70B9; &#x5F15; &#x5165; &#x7684; &#x590D; &#x6742; &#x5EA6; &#x4EE3; &#x4EF7;  &#x5DE6; &#x5B50; &#x6811; &#x5206; &#x6570;  &#x4E0D; &#x5206; &#x5272; &#x6211; &#x4EEC; &#x53EF; &#x4EE5; &#x62FF; &#x5230; &#x7684; &#x5206; &#x6570;  &#x53F3; &#x5B50; &#x6811; &#x5206; &#x6570; "></p>
<p>&#x8FD9;&#x4E2A;Gain&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x5355;&#x8282;&#x70B9;&#x7684;obj&#x51CF;&#x53BB;&#x5207;&#x5206;&#x540E;&#x7684;&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6811;obj&#xFF0C;Gain&#x5982;&#x679C;&#x662F;&#x6B63;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x503C;&#x8D8A;&#x5927;&#xFF0C;&#x8868;&#x793A;&#x5207;&#x5206;&#x540E;obj&#x8D8A;&#x5C0F;&#x4E8E;&#x5355;&#x8282;&#x70B9;&#x7684;obj&#xFF0C;&#x5C31;&#x8D8A;&#x503C;&#x5F97;&#x5207;&#x5206;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x5230;&#xFF0C;Gain&#x7684;&#x5DE6;&#x534A;&#x90E8;&#x5206;&#x5982;&#x679C;&#x5C0F;&#x4E8E;&#x53F3;&#x4FA7;&#x7684;&#x3B3;&#xFF0C;&#x5219;Gain&#x5C31;&#x662F;&#x8D1F;&#x7684;&#xFF0C;&#x8868;&#x660E;&#x5207;&#x5206;&#x540E;obj&#x53CD;&#x800C;&#x53D8;&#x5927;&#x4E86;&#x3002;&#x3B3;&#x5728;&#x8FD9;&#x91CC;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x4E34;&#x754C;&#x503C;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x8D8A;&#x5927;&#xFF0C;&#x8868;&#x793A;&#x6211;&#x4EEC;&#x5BF9;&#x5207;&#x5206;&#x540E;obj&#x4E0B;&#x964D;&#x5E45;&#x5EA6;&#x8981;&#x6C42;&#x8D8A;&#x4E25;&#x3002;&#x8FD9;&#x4E2A;&#x503C;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x5728;xgboost&#x4E2D;&#x8BBE;&#x5B9A;&#x7684;&#x3002;</p>
<p>&#x626B;&#x63CF;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x5207;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x5207;&#x5206;&#xFF0C;&#x5BF9;&#x5207;&#x5206;&#x51FA;&#x6765;&#x7684;&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x9012;&#x5F52;&#x5730;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x5207;&#x5206;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8F83;&#x597D;&#x7684;&#x6811;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;xgboost&#x7684;&#x5207;&#x5206;&#x64CD;&#x4F5C;&#x548C;&#x666E;&#x901A;&#x7684;&#x51B3;&#x7B56;&#x6811;&#x5207;&#x5206;&#x8FC7;&#x7A0B;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x3002;&#x666E;&#x901A;&#x7684;&#x51B3;&#x7B56;&#x6811;&#x5728;&#x5207;&#x5206;&#x7684;&#x65F6;&#x5019;&#x5E76;&#x4E0D;&#x8003;&#x8651;&#x6811;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x800C;&#x4F9D;&#x8D56;&#x540E;&#x7EED;&#x7684;&#x526A;&#x679D;&#x64CD;&#x4F5C;&#x6765;&#x63A7;&#x5236;&#x3002;xgboost&#x5728;&#x5207;&#x5206;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5DF2;&#x7ECF;&#x8003;&#x8651;&#x4E86;&#x6811;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5C31;&#x662F;&#x90A3;&#x4E2A;&#x3B3;&#x53C2;&#x6570;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5355;&#x72EC;&#x7684;&#x526A;&#x679D;&#x64CD;&#x4F5C;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;"><a href="#&#x53C2;&#x8003;&#x6587;&#x732E;" class="headerlink" title="&#x53C2;&#x8003;&#x6587;&#x732E;"></a>&#x53C2;&#x8003;&#x6587;&#x732E;</h2><p><a target="_blank" rel="noopener" href="https://blog.csdn.net/huacha__/article/details/81029680">XGBoost&#x2014;&#x2014;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF08;&#x7406;&#x8BBA;+&#x56FE;&#x89E3;+&#x5B89;&#x88C5;&#x65B9;&#x6CD5;+python&#x4EE3;&#x7801;&#xFF09;</a></p>


                <hr>

                

                <ul class="pager">
                    
                        <li class="previous">
                            <a href="/2019/10/01/机器学习基础/" data-toggle="tooltip" data-placement="top" title="机器学习基础">&larr; Previous Post</a>
                        </li>
                    
                    
                        <li class="next">
                            <a href="/2019/09/06/Boosting与AdaBoost/" data-toggle="tooltip" data-placement="top" title="Boosting与AdaBoost">Next Post &rarr;</a>
                        </li>
                    
                </ul>

                

                
                <!-- disqus 评论框 start -->
                <div class="comment">
                    <div id="disqus_thread" class="disqus-thread"></div>
                </div>
                <!-- disqus 评论框 end -->
                

            </div>
        <!-- Tabe of Content -->
            <!-- Table of Contents -->

<aside id="sidebar">
    <div id="toc" class="toc-article">
        <strong class="toc-title">Contents</strong>
        
            <ol class="toc-nav"><li class="toc-nav-item toc-nav-level-1"><a class="toc-nav-link" href="#XGBoost"><span class="toc-nav-number">1.</span> <span class="toc-nav-text">XGBoost</span></a><ol class="toc-nav-child"><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x7B97;&#x6CD5;&#x601D;&#x60F3;"><span class="toc-nav-number">1.1.</span> <span class="toc-nav-text">&amp;#x7B97;&amp;#x6CD5;&amp;#x601D;&amp;#x60F3;</span></a></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#XGBoost&#x539F;&#x7406;"><span class="toc-nav-number">1.2.</span> <span class="toc-nav-text">XGBoost&amp;#x539F;&amp;#x7406;</span></a></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x6A21;&#x578B;&#x6B63;&#x5219;&#x5316;&#x9879;"><span class="toc-nav-number">1.3.</span> <span class="toc-nav-text">&amp;#x6A21;&amp;#x578B;&amp;#x6B63;&amp;#x5219;&amp;#x5316;&amp;#x9879;</span></a></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x89C1;&#x8BC1;&#x5947;&#x8FF9;&#x7684;&#x65F6;&#x523B;"><span class="toc-nav-number">1.4.</span> <span class="toc-nav-text">&amp;#x89C1;&amp;#x8BC1;&amp;#x5947;&amp;#x8FF9;&amp;#x7684;&amp;#x65F6;&amp;#x523B;</span></a></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x53C2;&#x8003;&#x6587;&#x732E;"><span class="toc-nav-number">1.5.</span> <span class="toc-nav-text">&amp;#x53C2;&amp;#x8003;&amp;#x6587;&amp;#x732E;</span></a></li></ol></li></ol>
        
    </div>
</aside>

            <!-- Side Catalog Container -->
        

    <!-- Sidebar Container -->

            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                
                <section>
                    <!-- no hr -->
                    <h5><a href="/tags/">FEATURED TAGS</a></h5>
                    <div class="tags">
                       
                          <a class="tag" href="/tags/#机器学习" title="机器学习">机器学习</a>
                        
                    </div>
                </section>
                

                <!-- Friends Blog -->
                
                <hr>
                <h5>FRIENDS</h5>
                <ul class="list-inline">

                    
                        <li><a href="https://shitianming.github.io/" target="_blank">shitianming&#39;s Blog</a></li>
                    
                </ul>
                
            </div>

        </div>
    </div>
</article>




<!-- disqus 公共JS代码 start (一个网页只需插入一次) -->
<script type="text/javascript">
    /* * * CONFIGURATION VARIABLES * * */
    var disqus_shortname = "hexo-theme-huxblog";
    var disqus_identifier = "http://example.com/2019/09/11/XGBoost/";
    var disqus_url = "http://example.com/2019/09/11/XGBoost/";

    (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
</script>
<!-- disqus 公共JS代码 end -->




<!-- async load function -->
<script>


    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
    function IsPC() {
      var userAgentInfo = navigator.userAgent;
      var Agents = ["Android", "iPhone",
        "SymbianOS", "Windows Phone",
        "iPad", "iPod"];
      var flag = true;
      for (var v = 0; v < Agents.length; v++) {
        if (userAgentInfo.indexOf(Agents[v]) > 0) {
          flag = false;
          break;
        }
      }
      return flag;
    }
    setTimeout(()=> {
      if (!IsPC()) {
        var bignav = document.querySelector('.toc');//获取到导航栏id
        bignav.style.display = 'none';
        return
      }

      let tocText = document.getElementsByClassName('toc-nav-text')
      let arr = Array.prototype.slice.call(tocText)
      arr.forEach((item)=> {
        item.innerText = unescape(item.innerText.replace(/&#x/g,'%u').replace(/;/g,''))

      })

      var toc = document.getElementById('toc')

      if (toc != null) {
        window.addEventListener("scroll", scrollcatelogHandler);
        var tocPosition = toc.offsetTop;
        var height_header = $("#signature").height();
        function scrollcatelogHandler(e) {
          var event = e || window.event,
            target = event.target || event.srcElement;
          var scrollTop = document.documentElement.scrollTop || document.body.scrollTop;
          if (scrollTop >  tocPosition -60) {
            toc.classList.add("toc-fixed");
          } else {
            toc.classList.remove("toc-fixed");
          }
        }
      }


      //
      // window.onscroll= function(e){
      //   console.log(e)
      //   var topScroll = document.documentElement.scrollTop || document.body.scrollTop || window.pageYOffset || 0//滚动的距离,距离顶部的距离
      //
      //   var bignav = document.getElementById('#toc');//获取到导航栏id
      //   if(topScroll >= 532){
      //     //当滚动距离小于250的时候执行下面的内容，也就是让导航栏恢复原状
      //     bignav.style.position = 'fixed';
      //     bignav.style.top = '80px';
      //     bignav.style.right = '0';
      //   } else {
      //     bignav.style.position = 'absolute';
      //     bignav.style.top = '582px';
      //     bignav.style.right = '0';
      //   }
      //
      // }
      console.log(tocText)
    }, 0)

</script>
<!-- anchor-js, Doc:http://bryanbraun.github.io/anchorjs/ -->
<script>
    async("https://cdn.bootcss.com/anchor-js/1.1.1/anchor.min.js",function(){
        anchors.options = {
          visible: 'always',
          placement: 'right',
          icon: '#'
        };
        anchors.add().remove('.intro-header h1').remove('.subheading').remove('.sidebar-container h5');
    })
</script>
<style>
    /* place left on bigger screen */
    @media all and (min-width: 800px) {
        .anchorjs-link{
            position: absolute;

        }
    }
    .post-toc {
        position: absolute;
        top: 582px;
        right: 0;
    }
    .post-toc-child {
        min-width: 240px;
    }

</style>



    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                
                    <li>
                        <a target="_blank" href="https://www.zhihu.com/people/gao-ming-40-81">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa  fa-stack-1x fa-inverse">知</i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank" href="http://weibo.com/u/3874944289">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-weibo fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                

                
                    <li>
                        <a target="_blank"  href="https://github.com/gaoming95">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank"  href="https://www.linkedin.com/in/明-高-7570aa105">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-linkedin fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; Gao Ming’s Blog 2022 
                    <br>
					<!--
                    Theme by <a target="_blank" rel="noopener" href="http://huangxuan.me">Hux</a> 
                    <span style="display: inline-block; margin: 0 5px;">
                        <i class="fa fa-heart"></i>
                    </span> 
                    Ported by <a target="_blank" rel="noopener" href="http://blog.kaijun.rocks">Kaijun</a> | 
                    <iframe
                        style="margin-left: 2px; margin-bottom:-5px;"
                        frameborder="0" scrolling="0" width="91px" height="20px"
                        src="https://ghbtns.com/github-btn.html?user=kaijun&repo=hexo-theme-huxblog&type=star&count=true" >
                    </iframe>
					-->
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->

<script src="/js/jquery.min.js"></script>


<!-- Bootstrap Core JavaScript -->

<script src="/js/bootstrap.min.js"></script>


<!-- Custom Theme JavaScript -->

<script src="/js/hux-blog.min.js"></script>



<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>

<!-- 
     Because of the native support for backtick-style fenced code blocks 
     right within the Markdown is landed in Github Pages, 
     From V1.6, There is no need for Highlight.js, 
     so Huxblog drops it officially.

     - https://github.com/blog/2100-github-pages-now-faster-and-simpler-with-jekyll-3-0  
     - https://help.github.com/articles/creating-and-highlighting-code-blocks/    
-->
<!--
    <script>
        async("http://cdn.bootcss.com/highlight.js/8.6/highlight.min.js", function(){
            hljs.initHighlightingOnLoad();
        })
    </script>
    <link href="http://cdn.bootcss.com/highlight.js/8.6/styles/github.min.css" rel="stylesheet">
-->


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("http://example.com/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("https://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->




<!-- Baidu Tongji -->

<script>
    // dynamic User by Hux
    var _baId = '87fec1e5b2bb914ad19c5ba8ca638aad';

    // Originial
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?" + _baId;
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
</script>


<!-- Side Catalog -->




</body>

</html>
