<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="google-site-verification" content="xBT4GhYoi5qRD5tr338pgPM5OWHHIDR6mNg1a3euekI" />
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="技术博客">
    <meta name="keyword"  content="Java Python NLP">
    <link rel="shortcut icon" href="/img/favicon.ico">

    <title>
        
          朴素贝叶斯 - 高明的博客 | GaoMing&#39;s Blog
        
    </title>

    <link rel="canonical" href="http://example.com/2018/05/11/朴素贝叶斯/">

    <!-- Bootstrap Core CSS -->
    
<link rel="stylesheet" href="/css/bootstrap.min.css">


    <!-- Custom CSS -->
    
<link rel="stylesheet" href="/css/hux-blog.min.css">


    <!-- Pygments Highlight CSS -->
    
<link rel="stylesheet" href="/css/highlight.css">


    
<link rel="stylesheet" href="/css/toc.css">



    <!-- Custom Fonts -->
    <!-- <link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.3.0/css/font-awesome.min.css" rel="stylesheet" type="text/css"> -->
    <!-- Hux change font-awesome CDN to qiniu -->
    <link href="https://cdn.staticfile.org/font-awesome/4.5.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- Hux Delete, sad but pending in China
    <link href='http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'>
    <link href='http://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/
    css'>
    -->


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script>
<meta name="generator" content="Hexo 5.4.0"></head>


<!-- hack iOS CSS :active style -->
<body ontouchstart="">

    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">Gao Ming’s Blog</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/">Home</a>
                    </li>

                    

                        
                    

                        
                        <li>
                            <a href="/about/">About</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/tags/">Tags</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/archives/">Archives</a>
                        </li>
                        
                    
                    
                </ul>
            </div>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>


    <!-- Main Content -->
    
<!-- Image to hack wechat -->
<!-- <img src="{{ site.baseurl }}/img/icon_wechat.png" width="0" height="0"> -->
<!-- <img src="{{ site.baseurl }}/{% if page.header-img %}{{ page.header-img }}{% else %}{{ site.header-img }}{% endif %}" width="0" height="0"> -->

<!-- Post Header -->
<style type="text/css">
    header.intro-header{
        background-image: url('/img/home-bg.jpg')
    }
</style>
<header class="intro-header" >
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <div class="tags">
                        
                          <a class="tag" href="/tags/#机器学习" title="机器学习">机器学习</a>
                        
                    </div>
                    <h1>朴素贝叶斯</h1>
                    <h2 class="subheading">朴素贝叶斯</h2>
                    <span class="meta">
                        Posted by 高明 on
                        2018-05-11
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

    <!-- Post Container -->
            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                post-container">

                <h1 id="&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;"><a href="#&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;" class="headerlink" title="&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;"></a>&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;</h1><h2 id="&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;"><a href="#&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;" class="headerlink" title="&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;"></a>&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;</h2><p>&#x957F;&#x4E45;&#x4EE5;&#x6765;&#xFF0C;&#x4EBA;&#x4EEC;&#x5BF9;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x53D1;&#x751F;&#x6216;&#x4E0D;&#x53D1;&#x751F;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x53EA;&#x6709;&#x56FA;&#x5B9A;&#x7684;0&#x548C;1&#xFF0C;&#x5373;&#x8981;&#x4E48;&#x53D1;&#x751F;&#xFF0C;&#x8981;&#x4E48;&#x4E0D;&#x53D1;&#x751F;&#xFF0C;&#x4ECE;&#x6765;&#x4E0D;&#x4F1A;&#x53BB;&#x8003;&#x8651;&#x67D0;&#x4EF6;&#x4E8B;&#x60C5;&#x53D1;&#x751F;&#x7684;&#x6982;&#x7387;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x4E0D;&#x53D1;&#x751F;&#x7684;&#x6982;&#x7387;&#x53C8;&#x662F;&#x591A;&#x5927;&#x3002;&#x800C;&#x4E14;&#x6982;&#x7387;&#x867D;&#x7136;&#x672A;&#x77E5;&#xFF0C;&#x4F46;&#x6700;&#x8D77;&#x7801;&#x662F;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#x503C;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x5982;&#x679C;&#x95EE;&#x90A3;&#x65F6;&#x7684;&#x4EBA;&#x4EEC;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x201C;&#x6709;&#x4E00;&#x4E2A;&#x888B;&#x5B50;&#xFF0C;&#x91CC;&#x9762;&#x88C5;&#x7740;&#x82E5;&#x5E72;&#x4E2A;&#x767D;&#x7403;&#x548C;&#x9ED1;&#x7403;&#xFF0C;&#x8BF7;&#x95EE;&#x4ECE;&#x888B;&#x5B50;&#x4E2D;&#x53D6;&#x5F97;&#x767D;&#x7403;&#x7684;&#x6982;&#x7387;&#x662F;&#x591A;&#x5C11;&#xFF1F;&#x201D;&#x4ED6;&#x4EEC;&#x4F1A;&#x60F3;&#x90FD;&#x4E0D;&#x7528;&#x60F3;&#xFF0C;&#x4F1A;&#x7ACB;&#x9A6C;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x53D6;&#x51FA;&#x767D;&#x7403;&#x7684;&#x6982;&#x7387;&#x5C31;&#x662F;1/2&#xFF0C;&#x8981;&#x4E48;&#x53D6;&#x5230;&#x767D;&#x7403;&#xFF0C;&#x8981;&#x4E48;&#x53D6;&#x4E0D;&#x5230;&#x767D;&#x7403;&#xFF0C;&#x5373;&#x3B8;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x8BBA;&#x4F60;&#x53D6;&#x4E86;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x53D6;&#x5F97;&#x767D;&#x7403;&#x7684;&#x6982;&#x7387;&#x3B8;&#x59CB;&#x7EC8;&#x90FD;&#x662F;1/2&#xFF0C;&#x5373;&#x4E0D;&#x968F;&#x89C2;&#x5BDF;&#x7ED3;&#x679C;X &#x7684;&#x53D8;&#x5316;&#x800C;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x9891;&#x7387;&#x6D3E;&#x7684;&#x89C2;&#x70B9;&#x957F;&#x671F;&#x7EDF;&#x6CBB;&#x7740;&#x4EBA;&#x4EEC;&#x7684;&#x89C2;&#x5FF5;&#xFF0C;&#x4F46;&#x662F;&#xFF1A;</p>
<p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6709;&#x5982;&#x4E0B;&#x7684;7&#x4E2A;&#x7403;&#x5728;A,B&#x4E24;&#x4E2A;&#x6846;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x968F;&#x4FBF;&#x53D6;&#x4E00;&#x4E2A;&#x7403;&#xFF0C;&#x5DF2;&#x77E5;&#x53D6;&#x5230;&#x7684;&#x7403;&#x6765;&#x81EA;B&#x6846;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7403;&#x662F;&#x767D;&#x7403;&#x7684;&#x6982;&#x7387;&#x662F;&#x591A;&#x5C11;&#x5462;&#xFF1F;&#x6216;&#x8005;&#x95EE;&#x53D6;&#x51FA;&#x7684;&#x7403;&#x662F;&#x767D;&#x8272;&#xFF0C;&#x90A3;&#x4E48;&#x53D6;&#x81EA;B&#x6846;&#x7684;&#x6982;&#x7387;&#x662F;&#x591A;&#x5C11;&#x5462;&#xFF1F;</p>
<p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image001.png" alt="img"></p>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x89E3;&#x51B3;&#xFF0C;&#x76F4;&#x5230;&#x540E;&#x6765;&#x4E00;&#x4E2A;&#x540D;&#x53EB;Thomas Bayes&#x7684;&#x4EBA;&#x7269;&#x51FA;&#x73B0;&#x3002;</p>
<h3 id="&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x7684;&#x63D0;&#x51FA;"><a href="#&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x7684;&#x63D0;&#x51FA;" class="headerlink" title="&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x7684;&#x63D0;&#x51FA;"></a>&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x7684;&#x63D0;&#x51FA;</h3><p>  &#x6258;&#x9A6C;&#x65AF;&#xB7;&#x8D1D;&#x53F6;&#x65AF;Thomas Bayes&#xFF08;1702-1763&#xFF09;&#x53D1;&#x8868;&#x4E86;&#x4E00;&#x7BC7;&#x540D;&#x4E3A;&#x201C;An essay towards solving a problem in the doctrine of chances&#x201D;&#xFF0C;&#x7FFB;&#x8BD1;&#x8FC7;&#x6765;&#x5219;&#x662F;&#xFF1A;&#x673A;&#x9047;&#x7406;&#x8BBA;&#x4E2D;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x3002;&#x8BBA;&#x6587;&#x53D1;&#x8868;&#x540E;&#xFF0C;&#x5728;&#x5F53;&#x65F6;&#x5E76;&#x672A;&#x4EA7;&#x751F;&#x591A;&#x5C11;&#x5F71;&#x54CD;&#xFF0C;&#x5728;20&#x4E16;&#x7EAA;&#x540E;&#xFF0C;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x624D;&#x9010;&#x6E10;&#x88AB;&#x4EBA;&#x4EEC;&#x6240;&#x91CD;&#x89C6;&#x3002;</p>
<p>  &#x56DE;&#x5230;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;&#x201C;&#x6709;&#x4E00;&#x4E2A;&#x888B;&#x5B50;&#xFF0C;&#x91CC;&#x9762;&#x88C5;&#x7740;&#x82E5;&#x5E72;&#x4E2A;&#x767D;&#x7403;&#x548C;&#x9ED1;&#x7403;&#xFF0C;&#x8BF7;&#x95EE;&#x4ECE;&#x888B;&#x5B50;&#x4E2D;&#x53D6;&#x5F97;&#x767D;&#x7403;&#x7684;&#x6982;&#x7387;&#x3B8;&#x662F;&#x591A;&#x5C11;&#xFF1F;&#x201D;&#x8D1D;&#x53F6;&#x65AF;&#x8BA4;&#x4E3A;&#x53D6;&#x5F97;&#x767D;&#x7403;&#x7684;&#x6982;&#x7387;&#x662F;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x4E2D;&#x542B;&#x6709;&#x673A;&#x9047;&#x7684;&#x6210;&#x5206;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x521B;&#x4E1A;&#xFF0C;&#x4F60;&#x660E;&#x660E;&#x77E5;&#x9053;&#x521B;&#x4E1A;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x4E24;&#x79CD;&#xFF0C;&#x5373;&#x8981;&#x4E48;&#x6210;&#x529F;&#x8981;&#x4E48;&#x5931;&#x8D25;&#xFF0C;&#x4F46;&#x4F60;&#x4F9D;&#x7136;&#x4F1A;&#x5FCD;&#x4E0D;&#x4F4F;&#x53BB;&#x4F30;&#x8BA1;&#x4ED6;&#x521B;&#x4E1A;&#x6210;&#x529F;&#x7684;&#x51E0;&#x7387;&#x6709;&#x591A;&#x5927;&#xFF1F;&#x4F60;&#x5982;&#x679C;&#x5BF9;&#x4ED6;&#x4E3A;&#x4EBA;&#x6BD4;&#x8F83;&#x4E86;&#x89E3;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x65B9;&#x6CD5;&#x3001;&#x601D;&#x8DEF;&#x6E05;&#x6670;&#x3001;&#x6709;&#x6BC5;&#x529B;&#x3001;&#x4E14;&#x80FD;&#x56E2;&#x7ED3;&#x5468;&#x56F4;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x4F1A;&#x4E0D;&#x7531;&#x81EA;&#x4E3B;&#x7684;&#x4F30;&#x8BA1;&#x4ED6;&#x521B;&#x4E1A;&#x6210;&#x529F;&#x7684;&#x51E0;&#x7387;&#x53EF;&#x80FD;&#x5728;80%&#x4EE5;&#x4E0A;&#x3002;&#x8FD9;&#x79CD;&#x4E0D;&#x540C;&#x4E8E;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x201C;&#x975E;&#x9ED1;&#x5373;&#x767D;&#x3001;&#x975E;0&#x5373;1&#x201D;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#xFF0C;&#x4FBF;&#x662F;&#x8D1D;&#x53F6;&#x65AF;&#x5F0F;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x3002;</p>
<p>  &#x7EE7;&#x7EED;&#x6DF1;&#x5165;&#x8BB2;&#x89E3;&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x7B80;&#x5355;&#x603B;&#x7ED3;&#x4E0B;&#x9891;&#x7387;&#x6D3E;&#x4E0E;&#x8D1D;&#x53F6;&#x65AF;&#x6D3E;&#x5404;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#xFF1A;</p>
<p>  &#x9891;&#x7387;&#x6D3E;&#xFF1A;</p>
<p>  &#x9891;&#x7387;&#x6D3E;&#x628A;&#x9700;&#x8981;&#x63A8;&#x65AD;&#x7684;&#x53C2;&#x6570;&#x3B8;&#x770B;&#x505A;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x672A;&#x77E5;&#x5E38;&#x6570;&#xFF0C;&#x5373;&#x6982;&#x7387;&#x3B8;&#x867D;&#x7136;&#x662F;&#x672A;&#x77E5;&#x7684;&#xFF0C;&#x4F46;&#x6700;&#x8D77;&#x7801;&#x662F;&#x786E;&#x5B9A;&#x7684;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x6837;&#x672C;X &#x662F;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x9891;&#x7387;&#x6D3E;&#x91CD;&#x70B9;&#x7814;&#x7A76;&#x6837;&#x672C;&#x7A7A;&#x95F4;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x7684;&#x6982;&#x7387;&#x8BA1;&#x7B97;&#x90FD;&#x662F;&#x9488;&#x5BF9;&#x6837;&#x672C;X &#x7684;&#x5206;&#x5E03;&#xFF1B;</p>
<p>  &#x8D1D;&#x53F6;&#x65AF;&#x6D3E;&#xFF1A;</p>
<p>  &#x800C;&#x8D1D;&#x53F6;&#x65AF;&#x6D3E;&#x7684;&#x89C2;&#x70B9;&#x5219;&#x622A;&#x7136;&#x76F8;&#x53CD;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x53C2;&#x6570;&#x3B8;&#x662F;&#x968F;&#x673A;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x6837;&#x672C;X &#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x7531;&#x4E8E;&#x6837;&#x672C;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x91CD;&#x70B9;&#x7814;&#x7A76;&#x7684;&#x662F;&#x53C2;&#x6570;&#x3B8;&#x7684;&#x5206;&#x5E03;&#x3002;</p>
<p>&#x8D1D;&#x53F6;&#x65AF;&#x6D3E;&#x65E2;&#x7136;&#x628A;&#x3B8;&#x770B;&#x505A;&#x662F;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x8BA1;&#x7B97;&#x3B8;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x4FBF;&#x5F97;&#x4E8B;&#x5148;&#x77E5;&#x9053;&#x3B8;&#x7684;&#x65E0;&#x6761;&#x4EF6;&#x5206;&#x5E03;&#xFF0C;&#x5373;&#x5728;&#x6709;&#x6837;&#x672C;&#x4E4B;&#x524D;&#xFF08;&#x6216;&#x89C2;&#x5BDF;&#x5230;X&#x4E4B;&#x524D;&#xFF09;&#xFF0C;&#x3B8;&#x6709;&#x7740;&#x600E;&#x6837;&#x7684;&#x5206;&#x5E03;&#x5462;&#xFF1F;</p>
<p>  &#x6BD4;&#x5982;&#x5F80;&#x53F0;&#x7403;&#x684C;&#x4E0A;&#x6254;&#x4E00;&#x4E2A;&#x7403;&#xFF0C;&#x8FD9;&#x4E2A;&#x7403;&#x843D;&#x4F1A;&#x843D;&#x5728;&#x4F55;&#x5904;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x662F;&#x4E0D;&#x504F;&#x4E0D;&#x501A;&#x7684;&#x628A;&#x7403;&#x629B;&#x51FA;&#x53BB;&#xFF0C;&#x90A3;&#x4E48;&#x6B64;&#x7403;&#x843D;&#x5728;&#x53F0;&#x7403;&#x684C;&#x4E0A;&#x7684;&#x4EFB;&#x4E00;&#x4F4D;&#x7F6E;&#x90FD;&#x6709;&#x7740;&#x76F8;&#x540C;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5373;&#x7403;&#x843D;&#x5728;&#x53F0;&#x7403;&#x684C;&#x4E0A;&#x67D0;&#x4E00;&#x4F4D;&#x7F6E;&#x7684;&#x6982;&#x7387;&#x670D;&#x4ECE;&#x5747;&#x5300;&#x5206;&#x5E03;&#x3002;&#x8FD9;&#x79CD;&#x5728;&#x5B9E;&#x9A8C;&#x4E4B;&#x524D;&#x5B9A;&#x4E0B;&#x7684;&#x5C5E;&#x4E8E;&#x57FA;&#x672C;&#x524D;&#x63D0;&#x6027;&#x8D28;&#x7684;&#x5206;&#x5E03;&#x79F0;&#x4E3A;&#x5148;&#x9A8C;&#x5206;&#x5E03;&#xFF0C;&#x6216;&#x7684;&#x65E0;&#x6761;&#x4EF6;&#x5206;&#x5E03;&#x3002;</p>
<p>  &#x81F3;&#x6B64;&#xFF0C;&#x8D1D;&#x53F6;&#x65AF;&#x53CA;&#x8D1D;&#x53F6;&#x65AF;&#x6D3E;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x601D;&#x8003;&#x95EE;&#x9898;&#x7684;&#x56FA;&#x5B9A;&#x6A21;&#x5F0F;&#xFF1A;</p>
<p>&#x5148;&#x9A8C;&#x5206;&#x5E03; &#x3C0;(&#x3B8;)+ &#x6837;&#x672C;&#x4FE1;&#x606F;x&#x21D2; &#x540E;&#x9A8C;&#x5206;&#x5E03;&#x3C0;(&#x3B8;|x)</p>
<p>&#x4E0A;&#x8FF0;&#x601D;&#x8003;&#x6A21;&#x5F0F;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x65B0;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x6837;&#x672C;&#x4FE1;&#x606F;&#x5C06;&#x4FEE;&#x6B63;&#x4EBA;&#x4EEC;&#x4EE5;&#x524D;&#x5BF9;&#x4E8B;&#x7269;&#x7684;&#x8BA4;&#x77E5;&#x3002;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x5728;&#x5F97;&#x5230;&#x65B0;&#x7684;&#x6837;&#x672C;&#x4FE1;&#x606F;&#x4E4B;&#x524D;&#xFF0C;&#x4EBA;&#x4EEC;&#x5BF9;&#x7684;&#x8BA4;&#x77E5;&#x662F;&#x5148;&#x9A8C;&#x5206;&#x5E03; &#x3C0;(&#x3B8;)&#xFF0C;&#x5728;&#x5F97;&#x5230;&#x65B0;&#x7684;&#x6837;&#x672C;&#x4FE1;&#x606F;&#x540E;x&#xFF0C;&#x4EBA;&#x4EEC;&#x5BF9;&#x3B8;&#x7684;&#x8BA4;&#x77E5;&#x4E3A;&#x3C0;(&#x3B8;|x)&#x3002;</p>
<p>   &#x7EFC;&#x5408;&#x8D77;&#x6765;&#x770B;&#xFF0C;&#x5219;&#x597D;&#x6BD4;&#x662F;&#x4EBA;&#x7C7B;&#x521A;&#x5F00;&#x59CB;&#x65F6;&#x5BF9;&#x5927;&#x81EA;&#x7136;&#x53EA;&#x6709;&#x5C11;&#x5F97;&#x53EF;&#x601C;&#x7684;&#x5148;&#x9A8C;&#x77E5;&#x8BC6;&#xFF0C;&#x4F46;&#x968F;&#x7740;&#x4E0D;&#x65AD;&#x662F;&#x89C2;&#x5BDF;&#x3001;&#x5B9E;&#x9A8C;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x6837;&#x672C;&#x3001;&#x7ED3;&#x679C;&#xFF0C;&#x4F7F;&#x5F97;&#x4EBA;&#x4EEC;&#x5BF9;&#x81EA;&#x7136;&#x754C;&#x7684;&#x89C4;&#x5F8B;&#x6478;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x900F;&#x5F7B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x65E2;&#x7B26;&#x5408;&#x4EBA;&#x4EEC;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x7B26;&#x5408;&#x4EBA;&#x4EEC;&#x8BA4;&#x8BC6;&#x81EA;&#x7136;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E0D;&#x65AD;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x6700;&#x7EC8;&#x5360;&#x636E;&#x7EDF;&#x8BA1;&#x5B66;&#x9886;&#x57DF;&#x7684;&#x534A;&#x58C1;&#x6C5F;&#x5C71;&#xFF0C;&#x4E0E;&#x7ECF;&#x5178;&#x7EDF;&#x8BA1;&#x5B66;&#x5206;&#x5EAD;&#x6297;&#x793C;&#x3002;</p>
<h3 id="&#x8D1D;&#x53F6;&#x65AF;&#x5B9A;&#x7406;"><a href="#&#x8D1D;&#x53F6;&#x65AF;&#x5B9A;&#x7406;" class="headerlink" title="&#x8D1D;&#x53F6;&#x65AF;&#x5B9A;&#x7406;"></a>&#x8D1D;&#x53F6;&#x65AF;&#x5B9A;&#x7406;</h3><p>  &#x5728;&#x5F15;&#x51FA;&#x8D1D;&#x53F6;&#x65AF;&#x5B9A;&#x7406;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x5B66;&#x4E60;&#x51E0;&#x4E2A;&#x5B9A;&#x4E49;&#xFF1A;</p>
<p>  &#x8FB9;&#x7F18;&#x6982;&#x7387;&#xFF08;&#x53C8;&#x79F0;&#x5148;&#x9A8C;&#x6982;&#x7387;&#xFF09;&#xFF1A;&#x67D0;&#x4E2A;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x6982;&#x7387;&#x3002;&#x8FB9;&#x7F18;&#x6982;&#x7387;&#x662F;&#x8FD9;&#x6837;&#x5F97;&#x5230;&#x7684;&#xFF1A;&#x5728;&#x8054;&#x5408;&#x6982;&#x7387;&#x4E2D;&#xFF0C;&#x628A;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x4E2D;&#x90A3;&#x4E9B;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x4E8B;&#x4EF6;&#x901A;&#x8FC7;&#x5408;&#x5E76;&#x6210;&#x5B83;&#x4EEC;&#x7684;&#x5168;&#x6982;&#x7387;&#xFF0C;&#x800C;&#x6D88;&#x53BB;&#x5B83;&#x4EEC;&#xFF08;&#x5BF9;&#x79BB;&#x6563;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x7528;&#x6C42;&#x548C;&#x5F97;&#x5168;&#x6982;&#x7387;&#xFF0C;&#x5BF9;&#x8FDE;&#x7EED;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x7528;&#x79EF;&#x5206;&#x5F97;&#x5168;&#x6982;&#x7387;&#xFF09;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x8FB9;&#x7F18;&#x5316;&#xFF08;marginalization&#xFF09;&#xFF0C;&#x6BD4;&#x5982;A&#x7684;&#x8FB9;&#x7F18;&#x6982;&#x7387;&#x8868;&#x793A;&#x4E3A;P(A)&#xFF0C;B&#x7684;&#x8FB9;&#x7F18;&#x6982;&#x7387;&#x8868;&#x793A;&#x4E3A;P(B)&#x3002;</p>
<p>  &#x8054;&#x5408;&#x6982;&#x7387;&#x8868;&#x793A;&#x4E24;&#x4E2A;&#x4E8B;&#x4EF6;&#x5171;&#x540C;&#x53D1;&#x751F;&#x7684;&#x6982;&#x7387;&#x3002;A&#x4E0E;B&#x7684;&#x8054;&#x5408;&#x6982;&#x7387;&#x8868;&#x793A;&#x4E3A;P(A&#x2229;B)&#x6216;&#x8005;P(A,B)&#x3002;</p>
<p>  &#x6761;&#x4EF6;&#x6982;&#x7387;&#xFF08;&#x53C8;&#x79F0;&#x540E;&#x9A8C;&#x6982;&#x7387;&#xFF09;&#xFF1A;&#x4E8B;&#x4EF6;A&#x5728;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;B&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#x6761;&#x4EF6;&#x4E0B;&#x7684;&#x53D1;&#x751F;&#x6982;&#x7387;&#x3002;&#x6761;&#x4EF6;&#x6982;&#x7387;&#x8868;&#x793A;&#x4E3A;P(A|B)&#xFF0C;&#x8BFB;&#x4F5C;&#x201C;&#x5728;B&#x6761;&#x4EF6;&#x4E0B;A&#x7684;&#x6982;&#x7387;&#x201C;&#x3002;</p>
<p>  &#x63A5;&#x7740;&#xFF0C;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;P(A|B)&#x662F;&#x5728;B&#x53D1;&#x751F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;A&#x53D1;&#x751F;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<p>  &#x9996;&#x5148;&#xFF0C;&#x4E8B;&#x4EF6;B&#x53D1;&#x751F;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x4E8B;&#x4EF6;A&#x7684;&#x53D1;&#x751F;&#x6709;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x6982;&#x7387;&#x5224;&#x65AD;&#xFF0C;&#x79F0;&#x4E3A;A&#x7684;&#x5148;&#x9A8C;&#x6982;&#x7387;&#xFF0C;&#x7528;P(A)&#x8868;&#x793A;&#xFF1B;</p>
<p>  &#x5176;&#x6B21;&#xFF0C;&#x4E8B;&#x4EF6;B&#x53D1;&#x751F;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x4E8B;&#x4EF6;A&#x7684;&#x53D1;&#x751F;&#x6982;&#x7387;&#x91CD;&#x65B0;&#x8BC4;&#x4F30;&#xFF0C;&#x79F0;&#x4E3A;A&#x7684;&#x540E;&#x9A8C;&#x6982;&#x7387;&#xFF0C;&#x7528;P(A|B)&#x8868;&#x793A;&#xFF1B;</p>
<p>  &#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x4E8B;&#x4EF6;A&#x53D1;&#x751F;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x4E8B;&#x4EF6;B&#x7684;&#x53D1;&#x751F;&#x6709;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x6982;&#x7387;&#x5224;&#x65AD;&#xFF0C;&#x79F0;&#x4E3A;B&#x7684;&#x5148;&#x9A8C;&#x6982;&#x7387;&#xFF0C;&#x7528;P(B)&#x8868;&#x793A;&#xFF1B;</p>
<p>  &#x540C;&#x6837;&#xFF0C;&#x4E8B;&#x4EF6;A&#x53D1;&#x751F;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x4E8B;&#x4EF6;B&#x7684;&#x53D1;&#x751F;&#x6982;&#x7387;&#x91CD;&#x65B0;&#x8BC4;&#x4F30;&#xFF0C;&#x79F0;&#x4E3A;B&#x7684;&#x540E;&#x9A8C;&#x6982;&#x7387;&#xFF0C;&#x7528;P(B|A)&#x8868;&#x793A;&#x3002;</p>
<p>  &#x8D1D;&#x53F6;&#x65AF;&#x5B9A;&#x7406;&#x4FBF;&#x662F;&#x57FA;&#x4E8E;&#x4E0B;&#x8FF0;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;&#xFF1A;</p>
<p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image002.png" alt="img"></p>
<p>  &#x800C;&#x5B83;&#x5176;&#x5B9E;&#x662F;&#x7531;&#x4EE5;&#x4E0B;&#x7684;&#x8054;&#x5408;&#x6982;&#x7387;&#x516C;&#x5F0F;&#x63A8;&#x5BFC;&#x51FA;&#x6765;&#x7684;&#xFF1A;</p>
<p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image003.png" alt="img"></p>
<p>&#x5176;&#x4E2D;&#x662F;&#x5148;&#x9A8C;&#x6982;&#x7387;&#xFF0C;&#x662F;&#x540E;&#x9A8C;&#x6982;&#x7387;&#xFF0C;&#x662F;&#x8054;&#x5408;&#x6982;&#x7387;&#x3002;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image004.png" alt="img"></p>
<h2 id="&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x89C6;&#x89D2;&#x7406;&#x89E3;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;"><a href="#&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x89C6;&#x89D2;&#x7406;&#x89E3;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;" class="headerlink" title="&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x89C6;&#x89D2;&#x7406;&#x89E3;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;"></a>&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x89C6;&#x89D2;&#x7406;&#x89E3;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;</h2><p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image005.png" alt="img"></p>
<p>  &#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x89C6;&#x89D2;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x7406;&#x89E3;&#x6210;&#x201C;&#x5177;&#x6709;&#x67D0;&#x7279;&#x5F81;&#x201D;&#xFF0C;&#x628A;&#x7406;&#x89E3;&#x6210;&#x201C;&#x7C7B;&#x522B;&#x6807;&#x7B7E;&#x201D;&#x3002;&#x5728;&#x7B80;&#x5355;&#x7684;&#x4E8C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7406;&#x89E3;&#x6210;&#x201C;&#x5C5E;&#x4E8E;&#x67D0;&#x7C7B;&#x201D;&#x7684;&#x6807;&#x7B7E;&#x3002;&#x4E8E;&#x662F;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;&#x5C31;&#x53D8;&#x5F62;&#x6210;&#x4E0B;&#x9762;&#x7684;&#x6837;&#x5B50;&#xFF1A;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image006.png" alt="img"></p>
<p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image007.png" alt="img"></p>
<p>  &#x800C;&#x6211;&#x4EEC;&#x4E8C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x6700;&#x7EC8;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x8981;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5927;&#x4E8E;1/2&#x5C31;&#x591F;&#x4E86;&#x3002;&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x628A;&#x8BA1;&#x7B97;&#x201C;&#x5177;&#x6709;&#x67D0;&#x7279;&#x5F81;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x5C5E;&#x4E8E;&#x67D0;&#x7C7B;&#x201D;&#x7684;&#x6982;&#x7387;&#x8F6C;&#x6362;&#x6210;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x201C;&#x5C5E;&#x4E8E;&#x67D0;&#x7C7B;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x5177;&#x6709;&#x67D0;&#x7279;&#x5F81;&#x201D;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x83B7;&#x53D6;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x7B80;&#x5355;&#x591A;&#x4E86;&#x3002;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image008.png" alt="img"></p>
<p>  &#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x627E;&#x5230;&#x4E00;&#x4E9B;&#x5305;&#x542B;&#x5DF2;&#x77E5;&#x7279;&#x5F81;&#x6807;&#x7B7E;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x5373;&#x53EF;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;&#x800C;&#x6837;&#x672C;&#x7684;&#x7C7B;&#x522B;&#x6807;&#x7B7E;&#x90FD;&#x662F;&#x660E;&#x786E;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x91CC;&#x5C5E;&#x4E8E;&#x6709;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x3002;</p>
<p>  &#x8865;&#x5145;&#xFF1A;&#x4E00;&#x822C;&#x201C;&#x5148;&#x9A8C;&#x6982;&#x7387;&#x201D;&#x548C;&#x201C;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x201D;&#x662F;&#x76F8;&#x5BF9;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4E0E;&#x662F;&#x5173;&#x4E8E;&#x7684;&#x5148;&#x9A8C;&#x6982;&#x7387;&#x4E0E;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x3002;&#x4E0E;&#x662F;&#x5173;&#x4E8E;&#x7684;&#x5148;&#x9A8C;&#x6982;&#x7387;&#x548C;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x3002;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image009.png" alt="img"></p>
<h2 id="&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x5206;&#x7C7B;"><a href="#&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x5206;&#x7C7B;" class="headerlink" title="&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x5206;&#x7C7B;"></a>&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x5206;&#x7C7B;</h2><p>  &#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8981;&#x5BF9;&#x90AE;&#x4EF6;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x8BC6;&#x522B;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x548C;&#x666E;&#x901A;&#x90AE;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x90A3;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5927;&#x4E8E;1/2&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6709;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x548C;&#x6B63;&#x5E38;&#x90AE;&#x4EF6;&#x5404;1&#x4E07;&#x5C01;&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;&#x9700;&#x8981;&#x5224;&#x65AD;&#x4EE5;&#x4E0B;&#x90AE;&#x4EF6;&#x662F;&#x5426;&#x5C5E;&#x4E8E;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x3002;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image010.png" alt="img"></p>
<p>&#x201C;&#x6211;&#x53F8;&#x53EF;&#x529E;&#x7406;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#xFF08;&#x4FDD;&#x771F;&#xFF09;17%&#x589E;&#x503C;&#x7A0E;&#x53D1;&#x7968;&#x70B9;&#x6570;&#x4F18;&#x60E0;&#x201D;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x5224;&#x65AD;&#x6982;&#x7387;&#x662F;&#x5426;&#x5927;&#x4E8E;1/2&#x3002;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image011.png" alt="img"></p>
<p>  &#x8BAD;&#x7EC3;&#x96C6;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x800C;&#x53E5;&#x5B50;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x662F;&#x65E0;&#x9650;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x62FF;&#x53E5;&#x5B50;&#x4F5C;&#x4E3A;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x662F;&#x62FF;&#x53E5;&#x5B50;&#x91CC;&#x9762;&#x7684;&#x8BCD;&#x8BED;&#x4F5C;&#x4E3A;&#x7279;&#x5F81;&#x53BB;&#x8003;&#x8651;&#x3002;</p>
<p>&#x201C;&#x6211;&#x201D;,&#x201D;&#x53F8;&#x201D;,&#x201D;&#x53EF;&#x201D;,&#x201D;&#x529E;&#x7406;&#x201D;,&#x201D;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x4FDD;&#x771F;&#x201D;,&#x201D;&#x589E;&#x503C;&#x7A0E;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x70B9;&#x6570;&#x201D;,&#x201D;&#x4F18;&#x60E0;&#x201D;</p>
<p>  &#x4E8E;&#x662F;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#xFF1A;</p>
<p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image012.png" alt="img"></p>
<p>=<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image013.png" alt="img"></p>
<p>  &#x540C;&#x7406;</p>
<p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image014.png" alt="img"></p>
<p>=<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image015.png" alt="img"></p>
<h3 id="&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x5047;&#x8BBE;"><a href="#&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x5047;&#x8BBE;" class="headerlink" title="&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x5047;&#x8BBE;"></a>&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x5047;&#x8BBE;</h3><p>  &#x6982;&#x7387;&#x4F9D;&#x65E7;&#x4E0D;&#x597D;&#x6C42;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x5F88;&#x6734;&#x7D20;&#x7684;&#x8FD1;&#x4F3C;&#x3002;&#x4E3A;&#x4E86;&#x8BA9;&#x516C;&#x5F0F;&#x663E;&#x5F97;&#x66F4;&#x52A0;&#x7D27;&#x51D1;&#xFF0C;&#x6211;&#x4EEC;&#x4EE4;&#x5B57;&#x6BCD;S&#x8868;&#x793A;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#xFF0C;&#x5B57;&#x6BCD;H&#x8868;&#x793A;&#x6B63;&#x5E38;&#x90AE;&#x4EF6;&#x3002;&#x8FD1;&#x4F3C;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image016.png" alt="img"></p>
<p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image017.png" alt="img"></p>
<p>=P(&#x201C;&#x6211;&#x201D;|S)P(&#x201C;&#x53F8;&#x201D;|S)P(&#x201C;&#x53EF;&#x201D;|S)P(&#x201C;&#x529E;&#x7406;&#x201D;|S)P(&#x201C;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#x201D;|S)&#x2026;P(&#x201C;&#x4F18;&#x60E0;&#x201D;|S)</p>
<p>  &#x8FD9;&#x5C31;&#x662F;&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x5047;&#x8BBE;</p>
<p>  &#x5176;&#x4E2D;P(&#x201C;&#x4F18;&#x60E0;&#x201D;|S)=<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image018.png" alt="img"></p>
<p>  &#x8FD9;&#x6837;&#xFF0C;&#x5F0F;&#x5B50;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x7279;&#x522B;&#x597D;&#x6C42;&#x3002;&#x53EA;&#x9700;&#x8981;&#x5206;&#x7C7B;&#x7EDF;&#x8BA1;&#x5404;&#x7C7B;&#x90AE;&#x4EF6;&#x4E2D;&#x8BE5;&#x5173;&#x952E;&#x5B57;&#x51FA;&#x73B0;&#x7684;&#x6982;&#x7387;&#x5C31;&#x53EF;&#x4EE5;&#x3002;&#x7EDF;&#x8BA1;&#x6B21;&#x6570;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#xFF0C;&#x800C;&#x4E14;&#x6837;&#x672C;&#x6570;&#x91CF;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x6982;&#x7387;&#x6BD4;&#x8F83;&#x63A5;&#x8FD1;&#x771F;&#x5B9E;&#x3002;</p>
<h2 id="&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#xFF08;Naive-Bayes&#xFF09;-Naive&#x5728;&#x4F55;&#x5904;"><a href="#&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#xFF08;Naive-Bayes&#xFF09;-Naive&#x5728;&#x4F55;&#x5904;" class="headerlink" title="&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#xFF08;Na&#xEF;ve Bayes&#xFF09; Naive&#x5728;&#x4F55;&#x5904;"></a>&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#xFF08;Na&#xEF;ve Bayes&#xFF09; Naive&#x5728;&#x4F55;&#x5904;</h2><p>  &#x52A0;&#x4E0A;&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x5047;&#x8BBE;&#x7684;&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x3002;</p>
<p>  Naive&#x7684;&#x610F;&#x601D;&#x662F;&#x201C;&#x6734;&#x7D20;&#x7684;&#x201D;&#xFF0C;&#x201C;&#x5E7C;&#x7A1A;&#x7684;&#x201D;&#xFF0C;&#x201C;&#x611A;&#x8822;&#x7684;&#x201D;&#xFF0C;&#x5927;&#x795E;&#x4EEC;&#x53D6;&#x540D;&#x8BF4;&#x8BE5;&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x8F83;&#x8822;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>  &#x5C06;&#x53E5;&#x5B50;&#x4E2D;&#x7684;&#x201D;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#x201D;&#x8C03;&#x6362;&#x4EE5;&#x4E0B;&#x987A;&#x5E8F;&#xFF0C;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x53E5;&#x5B50;&#x3002;&#x65B0;&#x53E5;&#x5B50;&#x4E0E;&#x65E7;&#x53E5;&#x5B50;&#x7684;&#x610F;&#x601D;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x3002;&#x4F46;&#x7531;&#x4E8E;&#x4E58;&#x6CD5;&#x4EA4;&#x6362;&#x5F8B;&#xFF0C;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x4E2D;&#x7B97;&#x51FA;&#x6765;&#x4E8C;&#x8005;&#x7684;&#x6761;&#x4EF6;&#x6982;&#x7387;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x3002;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image019.png" alt="img"></p>
<p>  &#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x5931;&#x53BB;&#x4E86;&#x8BCD;&#x8BED;&#x4E4B;&#x95F4;&#x7684;&#x987A;&#x5E8F;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x628A;&#x6240;&#x6709;&#x7684;&#x8BCD;&#x6C47;&#x6254;&#x8FDB;&#x4E00;&#x4E2A;&#x888B;&#x5B50;&#x91CC;&#x968F;&#x4FBF;&#x6405;&#x548C;&#xFF0C;&#x8D1D;&#x53F6;&#x65AF;&#x8BA4;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E00;&#x6837;&#x3002;&#x56E0;&#x6B64;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E5F;&#x79F0;&#x4F5C;&#x8BCD;&#x888B;&#x6A21;&#x578B;</p>
<p>  &#x8BCD;&#x888B;&#x6A21;&#x578B;&#x4E0E;&#x4EBA;&#x4EEC;&#x7684;&#x65E5;&#x5E38;&#x7ECF;&#x9A8C;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x5047;&#x8BBE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x201C;&#x6B66;&#x677E;&#x6253;&#x6B7B;&#x4E86;&#x8001;&#x864E;&#x201D;&#x548C;&#x201C;&#x8001;&#x864E;&#x6253;&#x6B7B;&#x4E86;&#x6B66;&#x677E;&#x201D;&#x88AB;&#x5B83;&#x8BA4;&#x4F5C;&#x4E00;&#x4E2A;&#x610F;&#x601D;&#x3002;</p>
<h2 id="&#x5904;&#x7406;&#x91CD;&#x590D;&#x8BCD;&#x8BED;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;"><a href="#&#x5904;&#x7406;&#x91CD;&#x590D;&#x8BCD;&#x8BED;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;" class="headerlink" title="&#x5904;&#x7406;&#x91CD;&#x590D;&#x8BCD;&#x8BED;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;"></a>&#x5904;&#x7406;&#x91CD;&#x590D;&#x8BCD;&#x8BED;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;</h2><p>  &#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5904;&#x7406;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x5411;&#x91CF;&#x4E2D;</p>
<p>  &#x201C;&#x6211;&#x201D;,&#x201D;&#x53F8;&#x201D;,&#x201D;&#x53EF;&#x201D;,&#x201D;&#x529E;&#x7406;&#x201D;,&#x201D;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x4FDD;&#x771F;&#x201D;,&#x201D;&#x589E;&#x503C;&#x7A0E;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x70B9;&#x6570;&#x201D;,&#x201D;&#x4F18;&#x60E0;&#x201D;</p>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x8BCD;&#x90FD;&#x4E0D;&#x91CD;&#x590D;&#xFF0C;&#x800C;&#x5728;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#x5176;&#x5B9E;&#x5F88;&#x5C11;&#x89C1;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x6587;&#x672C;&#x957F;&#x5EA6;&#x589E;&#x52A0;&#xFF0C;&#x6216;&#x8005;&#x5206;&#x8BCD;&#x65B9;&#x6CD5;&#x6539;&#x53D8;&#xFF0C;&#x5FC5;&#x7136;&#x4F1A;&#x6709;&#x8BB8;&#x591A;&#x8BCD;&#x91CD;&#x590D;&#x51FA;&#x73B0;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x8FDB;&#x4E00;&#x6B65;&#x63A2;&#x8BA8;&#x3002;</p>
<p>  &#x6BD4;&#x5982;&#x4EE5;&#x4E0B;&#x90AE;&#x4EF6;&#xFF1A;</p>
<p>  &#x201C;&#x4EE3;&#x5F00;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x589E;&#x503C;&#x7A0E;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#x201D;</p>
<p>  &#x5206;&#x8BCD;&#x4E4B;&#x540E;&#x7684;&#x5411;&#x91CF;&#x4E3A;&#xFF1A;</p>
<p>  &#x201C;&#x4EE3;&#x5F00;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x589E;&#x503C;&#x7A0E;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x6B63;&#x89C4;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;</p>
<h3 id="&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;"><a href="#&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;" class="headerlink" title="&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;"></a>&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;</h3><p>  &#x5982;&#x679C;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x91CD;&#x590D;&#x8BCD;&#x8BED;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x91CD;&#x590D;&#x7684;&#x8BCD;&#x8BED;&#x6211;&#x4EEC;&#x89C6;&#x4E3A;&#x5176;&#x51FA;&#x73B0;&#x591A;&#x6B21;&#xFF0C;&#x76F4;&#x63A5;&#x6309;&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x5047;&#x8BBE;&#x7684;&#x65B9;&#x5F0F;&#x63A8;&#x5BFC;&#xFF0C;&#x5219;&#x6709;&#xFF1A;</p>
<p>P(&#x201C;&#x4EE3;&#x5F00;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x589E;&#x503C;&#x7A0E;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x6B63;&#x89C4;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;|S)</p>
<p>=P(&#x201C;&#x4EE3;&#x5F00;&#x201D;|S)P(&#x201C;&#x589E;&#x503C;&#x7A0E;&#x201D;|S)P(&#x201C;&#x6B63;&#x89C4;&#x201D;|S)<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image020.png" alt="img"></p>
<p>  &#x5728;&#x8BA1;&#x7B97;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x88AB;&#x7EDF;&#x8BA1;&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x6837;&#x672C;&#x4E2D;&#x91CD;&#x590D;&#x7684;&#x8BCD;&#x8BED;&#x4E5F;&#x7EDF;&#x8BA1;&#x4E86;&#x591A;&#x6B21;&#x3002;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image021.png" alt="img"></p>
<p>=<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image022.png" alt="img"></p>
<p>  &#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x4E2D;&#xFF0C;&#x6709;&#x4E9B;&#x6982;&#x7387;&#x51FA;&#x73B0;&#x6B21;&#x65B9;&#x7684;&#x5F62;&#x5F0F;&#xFF08;&#x591A;&#x6B21;&#x4E58;&#x79EF;&#xFF09;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;</p>
<h3 id="&#x4F2F;&#x52AA;&#x5229;&#x6A21;&#x578B;"><a href="#&#x4F2F;&#x52AA;&#x5229;&#x6A21;&#x578B;" class="headerlink" title="&#x4F2F;&#x52AA;&#x5229;&#x6A21;&#x578B;"></a>&#x4F2F;&#x52AA;&#x5229;&#x6A21;&#x578B;</h3><p>  &#x53E6;&#x4E00;&#x79CD;&#x66F4;&#x52A0;&#x7B80;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x91CD;&#x590D;&#x7684;&#x8BCD;&#x8BED;&#x90FD;&#x89C6;&#x4E3A;&#x5176;&#x53EA;&#x51FA;&#x73B0;1&#x6B21;</p>
<p>P(&#x201C;&#x4EE3;&#x5F00;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x589E;&#x503C;&#x7A0E;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;,&#x201D;&#x6B63;&#x89C4;&#x201D;,&#x201D;&#x53D1;&#x7968;&#x201D;|S)</p>
<p>=P(&#x201C;&#x4EE3;&#x5F00;&#x201D;|S)P(&#x201C;&#x589E;&#x503C;&#x7A0E;&#x201D;|S)P(&#x201C;&#x6B63;&#x89C4;&#x201D;|S)<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image023.png" alt="img"></p>
<p>  &#x7EDF;&#x8BA1;&#x8BA1;&#x7B97;&#x65F6;&#x4E5F;&#x662F;&#x5982;&#x8BCD;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image024.png" alt="img"></p>
<p>=<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image025.png" alt="img"></p>
<p>  &#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#x53EB;&#x505A;&#x4F2F;&#x52AA;&#x5229;&#x6A21;&#x578B;&#xFF08;&#x53C8;&#x79F0;&#x4E3A;&#x4E8C;&#x9879;&#x72EC;&#x7ACB;&#x6A21;&#x578B;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x66F4;&#x52A0;&#x7B80;&#x5316;&#x4E0E;&#x65B9;&#x4FBF;&#x3002;&#x5F53;&#x7136;&#x4E22;&#x5931;&#x4E86;&#x8BCD;&#x9891;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x6548;&#x679C;&#x53EF;&#x80FD;&#x4F1A;&#x5DEE;&#x4E00;&#x4E9B;&#x3002;</p>
<h3 id="&#x6DF7;&#x5408;&#x6A21;&#x578B;"><a href="#&#x6DF7;&#x5408;&#x6A21;&#x578B;" class="headerlink" title="&#x6DF7;&#x5408;&#x6A21;&#x578B;"></a>&#x6DF7;&#x5408;&#x6A21;&#x578B;</h3><p>  &#x7B2C;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x5728;&#x8BA1;&#x7B97;&#x53E5;&#x5B50;&#x6982;&#x7387;&#x65F6;&#xFF0C;&#x4E0D;&#x8003;&#x8651;&#x91CD;&#x590D;&#x8BCD;&#x8BED;&#x51FA;&#x73B0;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x7EDF;&#x8BA1;&#x8BA1;&#x7B97;&#x8BCD;&#x8BED;&#x7684;&#x6982;&#x7387;&#x65F6;&#xFF0C;&#x5374;&#x8003;&#x8651;&#x91CD;&#x590D;&#x8BCD;&#x8BED;&#x7684;&#x51FA;&#x73B0;&#x6B21;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x53EB;&#x505A;&#x6DF7;&#x5408;&#x6A21;&#x578B;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image026.png" alt="img"></p>
<h2 id="&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x5B66;&#x4E60;&#x4E0E;&#x5206;&#x7C7B;"><a href="#&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x5B66;&#x4E60;&#x4E0E;&#x5206;&#x7C7B;" class="headerlink" title="&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x5B66;&#x4E60;&#x4E0E;&#x5206;&#x7C7B;"></a>&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x5B66;&#x4E60;&#x4E0E;&#x5206;&#x7C7B;</h2><h3 id="&#x57FA;&#x672C;&#x65B9;&#x6CD5;"><a href="#&#x57FA;&#x672C;&#x65B9;&#x6CD5;" class="headerlink" title="&#x57FA;&#x672C;&#x65B9;&#x6CD5;"></a>&#x57FA;&#x672C;&#x65B9;&#x6CD5;</h3><p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image027.png" alt="&#x4E5B; &#x201C; 0 &#x4E8C; x &#x201C; x ;  &#x4E00; &#x4E36; &#x201D; x &#x4E00; 0 &#x5DF4; &#x5196; co "></p>
<h3 id="&#x6781;&#x5927;&#x4F3C;&#x7136;&#x4F30;&#x8BA1;"><a href="#&#x6781;&#x5927;&#x4F3C;&#x7136;&#x4F30;&#x8BA1;" class="headerlink" title="&#x6781;&#x5927;&#x4F3C;&#x7136;&#x4F30;&#x8BA1;"></a>&#x6781;&#x5927;&#x4F3C;&#x7136;&#x4F30;&#x8BA1;</h3><p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image028.png" alt="img"></p>
<p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image029.png" alt="img"></p>
<h2 id="&#x8D1D;&#x53F6;&#x65AF;&#x4F30;&#x8BA1;&#xFF08;&#x5E73;&#x6ED1;&#x6280;&#x672F;&#xFF09;"><a href="#&#x8D1D;&#x53F6;&#x65AF;&#x4F30;&#x8BA1;&#xFF08;&#x5E73;&#x6ED1;&#x6280;&#x672F;&#xFF09;" class="headerlink" title="&#x8D1D;&#x53F6;&#x65AF;&#x4F30;&#x8BA1;&#xFF08;&#x5E73;&#x6ED1;&#x6280;&#x672F;&#xFF09;"></a>&#x8D1D;&#x53F6;&#x65AF;&#x4F30;&#x8BA1;&#xFF08;&#x5E73;&#x6ED1;&#x6280;&#x672F;&#xFF09;</h2><p>  &#x8BA1;&#x7B97;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#x5047;&#x8BBE;&#x6982;&#x7387;&#x65F6;</p>
<p>P(&#x201C;&#x6211;&#x201D;,&#x201D;&#x53F8;&#x201D;,&#x201D;&#x53EF;&#x201D;,&#x201D;&#x529E;&#x7406;&#x201D;,&#x201D;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#x201D;|S)</p>
<p>=P(&#x201C;&#x6211;&#x201D;|S)P(&#x201C;&#x53F8;&#x201D;|S)P(&#x201C;&#x53EF;&#x201D;|S)P(&#x201C;&#x529E;&#x7406;&#x201D;|S)P(&#x201C;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#x201D;|S)</p>
<p>  &#x6211;&#x4EEC;&#x626B;&#x63CF;&#x4E00;&#x4E0B;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x53D1;&#x73B0;&#x201C;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x8FC7;&#x3002;&#x4E8E;&#x662F;&#xFF0C;P(&#x201C;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#x201D;|S)=0,&#x95EE;&#x9898;&#x4E25;&#x91CD;&#x4E86;&#xFF0C;&#x6574;&#x4E2A;&#x6982;&#x7387;&#x90FD;&#x53D8;&#x6210;0&#x4E86;&#x3002;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x9762;&#x5BF9;&#x4E00;&#x5806;&#x7684;0&#xFF0C;&#x5931;&#x6548;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#x54EA;&#x6015;&#x518D;&#x5927;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x6709;&#x8986;&#x76D6;&#x4E0D;&#x4E86;&#x7684;&#x8BCD;&#x8BED;&#x3002;&#x672C;&#x8D28;&#x4E0A;&#x8FD8;&#x662F;&#x6837;&#x672C;&#x6570;&#x91CF;&#x592A;&#x5C11;&#xFF0C;&#x4E0D;&#x6EE1;&#x8DB3;&#x5927;&#x6570;&#x5B9A;&#x5F8B;&#xFF0C;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x6982;&#x7387;&#x5931;&#x771F;&#x3002;</p>
<p>  &#x4E00;&#x79CD;&#x5206;&#x6790;&#x601D;&#x8DEF;&#x662F;&#x76F4;&#x63A5;&#x4E0D;&#x8003;&#x8651;&#x8FD9;&#x6837;&#x7684;&#x8BCD;&#x8BED;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x9ED8;&#x8BA4;&#x7ED9;P(&#x201C;&#x6B63;&#x89C4;&#x53D1;&#x7968;&#x201D;|S)&#x8D4B;&#x503C;&#x4E3A;1&#xFF0C;&#x5176;&#x5B9E;&#x6548;&#x679C;&#x4E0D;&#x597D;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x7ED9;&#x6D6A;&#x8D39;&#x4E86;&#x3002;</p>
<p>  &#x8FDB;&#x4E00;&#x6B65;&#x5206;&#x6790;&#xFF0C;&#x65E2;&#x7136;&#x53EF;&#x4EE5;&#x9ED8;&#x8BA4;&#x8D4B;&#x503C;&#x4E3A;1&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x9ED8;&#x8BA4;&#x8D4B;&#x503C;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x6570;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5E73;&#x6ED1;&#x6280;&#x672F;&#x7684;&#x57FA;&#x672C;&#x601D;&#x8DEF;&#x3002;</p>
<h3 id="&#x62C9;&#x666E;&#x62C9;&#x65AF;&#x5E73;&#x6ED1;"><a href="#&#x62C9;&#x666E;&#x62C9;&#x65AF;&#x5E73;&#x6ED1;" class="headerlink" title="&#x62C9;&#x666E;&#x62C9;&#x65AF;&#x5E73;&#x6ED1;"></a>&#x62C9;&#x666E;&#x62C9;&#x65AF;&#x5E73;&#x6ED1;</h3><p>&#x62C9;&#x666E;&#x62C9;&#x65AF;&#x5E73;&#x6ED1;</p>
<p>=<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image030.png" alt="img"></p>
<p>7.2 &#x8D1D;&#x53F6;&#x65AF;&#x4F30;&#x8BA1;</p>
<p>  &#x7528;&#x6781;&#x5927;&#x4F3C;&#x7136;&#x4F30;&#x8BA1;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x6240;&#x8981;&#x4F30;&#x8BA1;&#x7684;&#x6982;&#x7387;&#x503C;&#x4E3A;0&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x65F6;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x4F7F;&#x5206;&#x7C7B;&#x4EA7;&#x751F;&#x504F;&#x5DEE;&#x3002;&#x89E3;&#x51B3;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x91C7;&#x7528;&#x8D1D;&#x53F6;&#x65AF;&#x4F30;&#x8BA1;&#x3002;</p>
<p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image031.png" alt="img"></p>
<p>&#x5F0F;&#x5B50;&#x4E2D;.&#x7B49;&#x4EF7;&#x4E8E;&#x5728;&#x968F;&#x673A;&#x53D8;&#x91CF;&#x5404;&#x4E2A;&#x53D6;&#x503C;&#x7684;&#x9891;&#x6570;&#x4E0A;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x3002;&#x4F46;&#x65F6;&#xFF0C;&#x5C31;&#x662F;&#x6781;&#x5927;&#x4F3C;&#x7136;&#x4F30;&#x8BA1;&#x3002;&#x5E38;&#x53D6;&#xFF0C;&#x8FD9;&#x65F6;&#x88AB;&#x6210;&#x4E3A;&#x62C9;&#x666E;&#x62C9;&#x65AF;&#x5E73;&#x6ED1;&#x3002;<img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image032.png" alt="img"></p>
<p>&#x540C;&#x7406;&#xFF0C;&#x5148;&#x9A8C;&#x6982;&#x7387;&#x7684;&#x8D1D;&#x53F6;&#x65AF;&#x4F30;&#x8BA1;&#x662F;&#xFF1A;</p>
<p><img src="/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/clip_image033.png" alt="img"></p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;"><a href="#&#x53C2;&#x8003;&#x6587;&#x732E;" class="headerlink" title="&#x53C2;&#x8003;&#x6587;&#x732E;"></a>&#x53C2;&#x8003;&#x6587;&#x732E;</h2><p><a target="_blank" rel="noopener" href="https://www.cnblogs.com/zhoulujun/p/8893393.html">&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;&#x7531;&#x6D45;&#x5165;&#x6DF1;&#x5927;&#x8BB2;&#x89E3;&#x2014;AI&#x57FA;&#x7840;&#x7B97;&#x6CD5;&#x5165;&#x95E8;</a></p>


                <hr>

                

                <ul class="pager">
                    
                        <li class="previous">
                            <a href="/2019/06/11/SVM/" data-toggle="tooltip" data-placement="top" title="SVM">&larr; Previous Post</a>
                        </li>
                    
                    
                        <li class="next">
                            <a href="/2018/05/11/过拟合和欠拟合/" data-toggle="tooltip" data-placement="top" title="过拟合和欠拟合">Next Post &rarr;</a>
                        </li>
                    
                </ul>

                

                
                <!-- disqus 评论框 start -->
                <div class="comment">
                    <div id="disqus_thread" class="disqus-thread"></div>
                </div>
                <!-- disqus 评论框 end -->
                

            </div>
        <!-- Tabe of Content -->
            <!-- Table of Contents -->

<aside id="sidebar">
    <div id="toc" class="toc-article">
        <strong class="toc-title">Contents</strong>
        
            <ol class="toc-nav"><li class="toc-nav-item toc-nav-level-1"><a class="toc-nav-link" href="#&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;"><span class="toc-nav-number">1.</span> <span class="toc-nav-text">&amp;#x6734;&amp;#x7D20;&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;</span></a><ol class="toc-nav-child"><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;"><span class="toc-nav-number">1.1.</span> <span class="toc-nav-text">&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;&amp;#x65B9;&amp;#x6CD5;</span></a><ol class="toc-nav-child"><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x8D1D;&#x53F6;&#x65AF;&#x65B9;&#x6CD5;&#x7684;&#x63D0;&#x51FA;"><span class="toc-nav-number">1.1.1.</span> <span class="toc-nav-text">&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;&amp;#x65B9;&amp;#x6CD5;&amp;#x7684;&amp;#x63D0;&amp;#x51FA;</span></a></li><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x8D1D;&#x53F6;&#x65AF;&#x5B9A;&#x7406;"><span class="toc-nav-number">1.1.2.</span> <span class="toc-nav-text">&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;&amp;#x5B9A;&amp;#x7406;</span></a></li></ol></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x89C6;&#x89D2;&#x7406;&#x89E3;&#x8D1D;&#x53F6;&#x65AF;&#x516C;&#x5F0F;"><span class="toc-nav-number">1.2.</span> <span class="toc-nav-text">&amp;#x7528;&amp;#x673A;&amp;#x5668;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x89C6;&amp;#x89D2;&amp;#x7406;&amp;#x89E3;&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;&amp;#x516C;&amp;#x5F0F;</span></a></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x5206;&#x7C7B;"><span class="toc-nav-number">1.3.</span> <span class="toc-nav-text">&amp;#x5783;&amp;#x573E;&amp;#x90AE;&amp;#x4EF6;&amp;#x5206;&amp;#x7C7B;</span></a><ol class="toc-nav-child"><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x6761;&#x4EF6;&#x72EC;&#x7ACB;&#x5047;&#x8BBE;"><span class="toc-nav-number">1.3.1.</span> <span class="toc-nav-text">&amp;#x6761;&amp;#x4EF6;&amp;#x72EC;&amp;#x7ACB;&amp;#x5047;&amp;#x8BBE;</span></a></li></ol></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#xFF08;Naive-Bayes&#xFF09;-Naive&#x5728;&#x4F55;&#x5904;"><span class="toc-nav-number">1.4.</span> <span class="toc-nav-text">&amp;#x6734;&amp;#x7D20;&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;&amp;#xFF08;Na&amp;#xEF;ve Bayes&amp;#xFF09; Naive&amp;#x5728;&amp;#x4F55;&amp;#x5904;</span></a></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x5904;&#x7406;&#x91CD;&#x590D;&#x8BCD;&#x8BED;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;"><span class="toc-nav-number">1.5.</span> <span class="toc-nav-text">&amp;#x5904;&amp;#x7406;&amp;#x91CD;&amp;#x590D;&amp;#x8BCD;&amp;#x8BED;&amp;#x7684;&amp;#x4E09;&amp;#x79CD;&amp;#x65B9;&amp;#x5F0F;</span></a><ol class="toc-nav-child"><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x591A;&#x9879;&#x5F0F;&#x6A21;&#x578B;"><span class="toc-nav-number">1.5.1.</span> <span class="toc-nav-text">&amp;#x591A;&amp;#x9879;&amp;#x5F0F;&amp;#x6A21;&amp;#x578B;</span></a></li><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x4F2F;&#x52AA;&#x5229;&#x6A21;&#x578B;"><span class="toc-nav-number">1.5.2.</span> <span class="toc-nav-text">&amp;#x4F2F;&amp;#x52AA;&amp;#x5229;&amp;#x6A21;&amp;#x578B;</span></a></li><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x6DF7;&#x5408;&#x6A21;&#x578B;"><span class="toc-nav-number">1.5.3.</span> <span class="toc-nav-text">&amp;#x6DF7;&amp;#x5408;&amp;#x6A21;&amp;#x578B;</span></a></li></ol></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#x5B66;&#x4E60;&#x4E0E;&#x5206;&#x7C7B;"><span class="toc-nav-number">1.6.</span> <span class="toc-nav-text">&amp;#x6734;&amp;#x7D20;&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;&amp;#x5B66;&amp;#x4E60;&amp;#x4E0E;&amp;#x5206;&amp;#x7C7B;</span></a><ol class="toc-nav-child"><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x57FA;&#x672C;&#x65B9;&#x6CD5;"><span class="toc-nav-number">1.6.1.</span> <span class="toc-nav-text">&amp;#x57FA;&amp;#x672C;&amp;#x65B9;&amp;#x6CD5;</span></a></li><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x6781;&#x5927;&#x4F3C;&#x7136;&#x4F30;&#x8BA1;"><span class="toc-nav-number">1.6.2.</span> <span class="toc-nav-text">&amp;#x6781;&amp;#x5927;&amp;#x4F3C;&amp;#x7136;&amp;#x4F30;&amp;#x8BA1;</span></a></li></ol></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x8D1D;&#x53F6;&#x65AF;&#x4F30;&#x8BA1;&#xFF08;&#x5E73;&#x6ED1;&#x6280;&#x672F;&#xFF09;"><span class="toc-nav-number">1.7.</span> <span class="toc-nav-text">&amp;#x8D1D;&amp;#x53F6;&amp;#x65AF;&amp;#x4F30;&amp;#x8BA1;&amp;#xFF08;&amp;#x5E73;&amp;#x6ED1;&amp;#x6280;&amp;#x672F;&amp;#xFF09;</span></a><ol class="toc-nav-child"><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x62C9;&#x666E;&#x62C9;&#x65AF;&#x5E73;&#x6ED1;"><span class="toc-nav-number">1.7.1.</span> <span class="toc-nav-text">&amp;#x62C9;&amp;#x666E;&amp;#x62C9;&amp;#x65AF;&amp;#x5E73;&amp;#x6ED1;</span></a></li></ol></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x53C2;&#x8003;&#x6587;&#x732E;"><span class="toc-nav-number">1.8.</span> <span class="toc-nav-text">&amp;#x53C2;&amp;#x8003;&amp;#x6587;&amp;#x732E;</span></a></li></ol></li></ol>
        
    </div>
</aside>

            <!-- Side Catalog Container -->
        

    <!-- Sidebar Container -->

            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                
                <section>
                    <!-- no hr -->
                    <h5><a href="/tags/">FEATURED TAGS</a></h5>
                    <div class="tags">
                       
                          <a class="tag" href="/tags/#机器学习" title="机器学习">机器学习</a>
                        
                    </div>
                </section>
                

                <!-- Friends Blog -->
                
                <hr>
                <h5>FRIENDS</h5>
                <ul class="list-inline">

                    
                        <li><a href="https://shitianming.github.io/" target="_blank">shitianming&#39;s Blog</a></li>
                    
                </ul>
                
            </div>

        </div>
    </div>
</article>




<!-- disqus 公共JS代码 start (一个网页只需插入一次) -->
<script type="text/javascript">
    /* * * CONFIGURATION VARIABLES * * */
    var disqus_shortname = "hexo-theme-huxblog";
    var disqus_identifier = "http://example.com/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/";
    var disqus_url = "http://example.com/2018/05/11/%E6%9C%B4%E7%B4%A0%E8%B4%9D%E5%8F%B6%E6%96%AF/";

    (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
</script>
<!-- disqus 公共JS代码 end -->




<!-- async load function -->
<script>


    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
    function IsPC() {
      var userAgentInfo = navigator.userAgent;
      var Agents = ["Android", "iPhone",
        "SymbianOS", "Windows Phone",
        "iPad", "iPod"];
      var flag = true;
      for (var v = 0; v < Agents.length; v++) {
        if (userAgentInfo.indexOf(Agents[v]) > 0) {
          flag = false;
          break;
        }
      }
      return flag;
    }
    setTimeout(()=> {
      if (!IsPC()) {
        var bignav = document.querySelector('.toc');//获取到导航栏id
        bignav.style.display = 'none';
        return
      }

      let tocText = document.getElementsByClassName('toc-nav-text')
      let arr = Array.prototype.slice.call(tocText)
      arr.forEach((item)=> {
        item.innerText = unescape(item.innerText.replace(/&#x/g,'%u').replace(/;/g,''))

      })

      var toc = document.getElementById('toc')

      if (toc != null) {
        window.addEventListener("scroll", scrollcatelogHandler);
        var tocPosition = toc.offsetTop;
        var height_header = $("#signature").height();
        function scrollcatelogHandler(e) {
          var event = e || window.event,
            target = event.target || event.srcElement;
          var scrollTop = document.documentElement.scrollTop || document.body.scrollTop;
          if (scrollTop >  tocPosition -60) {
            toc.classList.add("toc-fixed");
          } else {
            toc.classList.remove("toc-fixed");
          }
        }
      }


      //
      // window.onscroll= function(e){
      //   console.log(e)
      //   var topScroll = document.documentElement.scrollTop || document.body.scrollTop || window.pageYOffset || 0//滚动的距离,距离顶部的距离
      //
      //   var bignav = document.getElementById('#toc');//获取到导航栏id
      //   if(topScroll >= 532){
      //     //当滚动距离小于250的时候执行下面的内容，也就是让导航栏恢复原状
      //     bignav.style.position = 'fixed';
      //     bignav.style.top = '80px';
      //     bignav.style.right = '0';
      //   } else {
      //     bignav.style.position = 'absolute';
      //     bignav.style.top = '582px';
      //     bignav.style.right = '0';
      //   }
      //
      // }
      console.log(tocText)
    }, 0)

</script>
<!-- anchor-js, Doc:http://bryanbraun.github.io/anchorjs/ -->
<script>
    async("https://cdn.bootcss.com/anchor-js/1.1.1/anchor.min.js",function(){
        anchors.options = {
          visible: 'always',
          placement: 'right',
          icon: '#'
        };
        anchors.add().remove('.intro-header h1').remove('.subheading').remove('.sidebar-container h5');
    })
</script>
<style>
    /* place left on bigger screen */
    @media all and (min-width: 800px) {
        .anchorjs-link{
            position: absolute;

        }
    }
    .post-toc {
        position: absolute;
        top: 582px;
        right: 0;
    }
    .post-toc-child {
        min-width: 240px;
    }

</style>



    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                
                    <li>
                        <a target="_blank" href="https://www.zhihu.com/people/gao-ming-40-81">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa  fa-stack-1x fa-inverse">知</i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank" href="http://weibo.com/u/3874944289">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-weibo fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                

                
                    <li>
                        <a target="_blank"  href="https://github.com/gaoming95">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank"  href="https://www.linkedin.com/in/明-高-7570aa105">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-linkedin fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; Gao Ming’s Blog 2022 
                    <br>
					<!--
                    Theme by <a target="_blank" rel="noopener" href="http://huangxuan.me">Hux</a> 
                    <span style="display: inline-block; margin: 0 5px;">
                        <i class="fa fa-heart"></i>
                    </span> 
                    Ported by <a target="_blank" rel="noopener" href="http://blog.kaijun.rocks">Kaijun</a> | 
                    <iframe
                        style="margin-left: 2px; margin-bottom:-5px;"
                        frameborder="0" scrolling="0" width="91px" height="20px"
                        src="https://ghbtns.com/github-btn.html?user=kaijun&repo=hexo-theme-huxblog&type=star&count=true" >
                    </iframe>
					-->
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->

<script src="/js/jquery.min.js"></script>


<!-- Bootstrap Core JavaScript -->

<script src="/js/bootstrap.min.js"></script>


<!-- Custom Theme JavaScript -->

<script src="/js/hux-blog.min.js"></script>



<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>

<!-- 
     Because of the native support for backtick-style fenced code blocks 
     right within the Markdown is landed in Github Pages, 
     From V1.6, There is no need for Highlight.js, 
     so Huxblog drops it officially.

     - https://github.com/blog/2100-github-pages-now-faster-and-simpler-with-jekyll-3-0  
     - https://help.github.com/articles/creating-and-highlighting-code-blocks/    
-->
<!--
    <script>
        async("http://cdn.bootcss.com/highlight.js/8.6/highlight.min.js", function(){
            hljs.initHighlightingOnLoad();
        })
    </script>
    <link href="http://cdn.bootcss.com/highlight.js/8.6/styles/github.min.css" rel="stylesheet">
-->


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("http://example.com/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("https://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->




<!-- Baidu Tongji -->

<script>
    // dynamic User by Hux
    var _baId = '87fec1e5b2bb914ad19c5ba8ca638aad';

    // Originial
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?" + _baId;
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
</script>


<!-- Side Catalog -->




</body>

</html>
