<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="google-site-verification" content="xBT4GhYoi5qRD5tr338pgPM5OWHHIDR6mNg1a3euekI" />
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="技术博客">
    <meta name="keyword"  content="Java Python NLP">
    <link rel="shortcut icon" href="/img/favicon.ico">

    <title>
        
          过拟合和欠拟合 - 高明的博客 | GaoMing&#39;s Blog
        
    </title>

    <link rel="canonical" href="http://example.com/2018/05/11/过拟合和欠拟合/">

    <!-- Bootstrap Core CSS -->
    
<link rel="stylesheet" href="/css/bootstrap.min.css">


    <!-- Custom CSS -->
    
<link rel="stylesheet" href="/css/hux-blog.min.css">


    <!-- Pygments Highlight CSS -->
    
<link rel="stylesheet" href="/css/highlight.css">


    
<link rel="stylesheet" href="/css/toc.css">



    <!-- Custom Fonts -->
    <!-- <link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.3.0/css/font-awesome.min.css" rel="stylesheet" type="text/css"> -->
    <!-- Hux change font-awesome CDN to qiniu -->
    <link href="https://cdn.staticfile.org/font-awesome/4.5.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- Hux Delete, sad but pending in China
    <link href='http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'>
    <link href='http://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/
    css'>
    -->


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script>
<meta name="generator" content="Hexo 5.4.0"></head>


<!-- hack iOS CSS :active style -->
<body ontouchstart="">

    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">Gao Ming’s Blog</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/">Home</a>
                    </li>

                    

                        
                    

                        
                        <li>
                            <a href="/about/">About</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/tags/">Tags</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/archives/">Archives</a>
                        </li>
                        
                    
                    
                </ul>
            </div>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>


    <!-- Main Content -->
    
<!-- Image to hack wechat -->
<!-- <img src="{{ site.baseurl }}/img/icon_wechat.png" width="0" height="0"> -->
<!-- <img src="{{ site.baseurl }}/{% if page.header-img %}{{ page.header-img }}{% else %}{{ site.header-img }}{% endif %}" width="0" height="0"> -->

<!-- Post Header -->
<style type="text/css">
    header.intro-header{
        background-image: url('/img/home-bg.jpg')
    }
</style>
<header class="intro-header" >
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <div class="post-heading">
                    <div class="tags">
                        
                          <a class="tag" href="/tags/#机器学习" title="机器学习">机器学习</a>
                        
                          <a class="tag" href="/tags/#深度学习" title="深度学习">深度学习</a>
                        
                    </div>
                    <h1>过拟合和欠拟合</h1>
                    <h2 class="subheading">过拟合和欠拟合</h2>
                    <span class="meta">
                        Posted by 高明 on
                        2018-05-11
                    </span>
                </div>
            </div>
        </div>
    </div>
</header>

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

    <!-- Post Container -->
            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                post-container">

                <h1 id="&#x8FC7;&#x62DF;&#x5408;&#x548C;&#x6B20;&#x62DF;&#x5408;"><a href="#&#x8FC7;&#x62DF;&#x5408;&#x548C;&#x6B20;&#x62DF;&#x5408;" class="headerlink" title="&#x8FC7;&#x62DF;&#x5408;&#x548C;&#x6B20;&#x62DF;&#x5408;"></a>&#x8FC7;&#x62DF;&#x5408;&#x548C;&#x6B20;&#x62DF;&#x5408;</h1><p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x662F;</p>
<p>&#x5229;&#x7528;&#x6A21;&#x578B;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x62DF;&#x5408;&#xFF0C;&#x5B66;&#x4E60;&#x7684;&#x76EE;&#x7684;&#x5E76;&#x975E;&#x662F;&#x5BF9;&#x6709;&#x9650;&#x8BAD;&#x7EC3;&#x96C6;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x9884;&#x6D4B;&#xFF0C;&#x800C;&#x662F;&#x5BF9;&#x672A;&#x66FE;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x5408;&#x51FA;&#x73B0;&#x7684;&#x6837;&#x672C;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x9884;&#x6D4B;&#x3002;</p>
<p>&#x6A21;&#x578B;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x6570;&#x636E;&#x7684;&#x8BEF;&#x5DEE;&#x79F0;&#x4E3A;&#x7ECF;&#x9A8C;&#x8BEF;&#x5DEE;&#xFF0C;&#x5BF9;&#x6D4B;&#x8BD5;&#x96C6;&#x6570;&#x636E;&#x7684;&#x8BEF;&#x5DEE;&#x79F0;&#x4E3A;&#x6CDB;&#x5316;&#x8BEF;&#x5DEE;&#x3002;&#x6A21;&#x578B;&#x5BF9;&#x8BAD;&#x7EC3;&#x96C6;&#x4EE5;&#x5916;&#x6837;&#x672C;&#x7684;&#x9884;&#x6D4B;&#x80FD;&#x529B;&#x5C31;&#x79F0;&#x4E3A;&#x6A21;&#x578B;&#x7684;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#xFF0C;&#x8FFD;&#x6C42;&#x8FD9;&#x79CD;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x59CB;&#x7EC8;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x76EE;&#x6807;</p>
<p>&#x8FC7;&#x62DF;&#x5408;(overfitting)&#x548C;&#x6B20;&#x62DF;&#x5408;(underfitting)&#x662F;&#x5BFC;&#x81F4;&#x6A21;&#x578B;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x4E0D;&#x9AD8;&#x7684;&#x4E24;&#x79CD;&#x5E38;&#x89C1;&#x539F;&#x56E0;&#xFF0C;&#x90FD;&#x662F;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x4E0E;&#x6570;&#x636E;&#x590D;&#x6742;&#x5EA6;&#x4E4B;&#x95F4;&#x5931;&#x914D;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6B20;&#x62DF;&#x5408;&#x5E38;&#x5E38;&#x5728;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x8F83;&#x5F31;&#xFF0C;&#x800C;&#x6570;&#x636E;&#x590D;&#x6742;&#x5EA6;&#x8F83;&#x9AD8;&#x7684;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#xFF0C;&#x6B64;&#x65F6;&#x6A21;&#x578B;&#x7531;&#x4E8E;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x4E0D;&#x8DB3;&#xFF0C;&#x65E0;&#x6CD5;&#x5B66;&#x4E60;&#x5230;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7684;&#x201C;&#x4E00;&#x822C;&#x89C4;&#x5F8B;&#x201D;&#xFF0C;&#x56E0;&#x800C;&#x5BFC;&#x81F4;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x5F31;&#x3002;</p>
<p>&#x4E0E;&#x4E4B;&#x76F8;&#x53CD;&#xFF0C;&#x201C;&#x8FC7;&#x62DF;&#x5408;&#x201D;&#x5E38;&#x5E38;&#x5728;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x8FC7;&#x5F3A;&#x7684;&#x60C5;&#x51B5;&#x4E2D;&#x51FA;&#x73B0;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x6A21;&#x578B;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x592A;&#x5F3A;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5C06;&#x8BAD;&#x7EC3;&#x96C6;&#x5355;&#x4E2A;&#x6837;&#x672C;&#x81EA;&#x8EAB;&#x7684;&#x7279;&#x70B9;&#x90FD;&#x80FD;&#x6355;&#x6349;&#x5230;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x8BA4;&#x4E3A;&#x662F;&#x201C;&#x4E00;&#x822C;&#x89C4;&#x5F8B;&#x201D;&#xFF0C;&#x540C;&#x6837;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x6A21;&#x578B;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x4E0B;&#x964D;</p>
<p>&#x8FC7;&#x62DF;&#x5408;&#x4E0E;&#x6B20;&#x62DF;&#x5408;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x6B20;&#x62DF;&#x5408;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x6027;&#x80FD;&#x90FD;&#x8F83;&#x5DEE;&#xFF0C;&#x800C;&#x8FC7;&#x62DF;&#x5408;&#x5F80;&#x5F80;&#x80FD;&#x8F83;&#x597D;&#x5730;&#x5B66;&#x4E60;&#x8BAD;&#x7EC3;&#x96C6;&#x6570;&#x636E;&#x7684;&#x6027;&#x8D28;&#xFF0C;&#x800C;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x6027;&#x80FD;&#x8F83;&#x5DEE;&#x3002;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6B20;&#x62DF;&#x5408;&#x4E3B;&#x8981;&#x8868;&#x73B0;&#x4E3A;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x7684;&#x9AD8;&#x504F;&#x5DEE;&#xFF0C;&#x800C;&#x8FC7;&#x62DF;&#x5408;&#x4E3B;&#x8981;&#x8868;&#x73B0;&#x4E3A;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x7684;&#x9AD8;&#x65B9;&#x5DEE;</p>
<p><img src="/2018/05/11/%E8%BF%87%E6%8B%9F%E5%90%88%E5%92%8C%E6%AC%A0%E6%8B%9F%E5%90%88/clip_image001.png" alt="8  90 +  High bias  (underfit)  2  &quot;Just right&quot;  00 + + 02 $2 + +  High variance  (overfit) "></p>
<h2 id="&#x6B20;&#x62DF;&#x5408;"><a href="#&#x6B20;&#x62DF;&#x5408;" class="headerlink" title="&#x6B20;&#x62DF;&#x5408;"></a>&#x6B20;&#x62DF;&#x5408;</h2><p>&#x6B20;&#x62DF;&#x5408;&#x51FA;&#x73B0;&#x539F;&#x56E0;</p>
<ol>
<li>&#x6A21;&#x578B;&#x590D;&#x6742;&#x5EA6;&#x8FC7;&#x4F4E;</li>
<li>&#x7279;&#x5F81;&#x91CF;&#x8FC7;&#x5C11;</li>
</ol>
<p>&#x6B20;&#x62DF;&#x5408;&#x7684;&#x60C5;&#x51B5;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x514B;&#x670D;&#xFF0C;&#x5E38;&#x89C1;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x6709;</p>
<ol>
<li>&#x589E;&#x52A0;&#x65B0;&#x7279;&#x5F81;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x52A0;&#x5165;&#x8FDB;&#x7279;&#x5F81;&#x7EC4;&#x5408;&#x3001;&#x9AD8;&#x6B21;&#x7279;&#x5F81;&#xFF0C;&#x6765;&#x589E;&#x5927;&#x5047;&#x8BBE;&#x7A7A;&#x95F4;&#xFF1B;&#x6DFB;&#x52A0;&#x591A;&#x9879;&#x5F0F;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x4E2A;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x91CC;&#x9762;&#x7528;&#x7684;&#x5F88;&#x666E;&#x904D;&#xFF0C;&#x4F8B;&#x5982;&#x5C06;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x4E8C;&#x6B21;&#x9879;&#x6216;&#x8005;&#x4E09;&#x6B21;&#x9879;&#x4F7F;&#x6A21;&#x578B;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x66F4;&#x5F3A;</li>
<li>&#x51CF;&#x5C11;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;&#xFF0C;&#x6B63;&#x5219;&#x5316;&#x7684;&#x76EE;&#x7684;&#x662F;&#x7528;&#x6765;&#x9632;&#x6B62;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6A21;&#x578B;&#x51FA;&#x73B0;&#x4E86;&#x6B20;&#x62DF;&#x5408;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x51CF;&#x5C11;&#x6B63;&#x5219;&#x5316;&#x53C2;&#x6570;</li>
<li>&#x4F7F;&#x7528;&#x975E;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#x6838;SVM &#x3001;&#x51B3;&#x7B56;&#x6811;&#x3001;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B49;&#x6A21;&#x578B;</li>
<li>&#x8C03;&#x6574;&#x6A21;&#x578B;&#x7684;&#x5BB9;&#x91CF;(capacity)&#xFF0C;&#x901A;&#x4FD7;&#x5730;&#xFF0C;&#x6A21;&#x578B;&#x7684;&#x5BB9;&#x91CF;&#x662F;&#x6307;&#x5176;&#x62DF;&#x5408;&#x5404;&#x79CD;&#x51FD;&#x6570;&#x7684;&#x80FD;&#x529B;</li>
<li>&#x5BB9;&#x91CF;&#x4F4E;&#x7684;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x96C6;&#xFF1B;&#x4F7F;&#x7528;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;Bagging ,&#x5C06;&#x591A;&#x4E2A;&#x5F31;&#x5B66;&#x4E60;&#x5668;Bagging</li>
</ol>
<h2 id="&#x8FC7;&#x62DF;&#x5408;"><a href="#&#x8FC7;&#x62DF;&#x5408;" class="headerlink" title="&#x8FC7;&#x62DF;&#x5408;"></a>&#x8FC7;&#x62DF;&#x5408;</h2><p>&#x8FC7;&#x62DF;&#x5408;&#x51FA;&#x73B0;&#x539F;&#x56E0;</p>
<p>&#x5EFA;&#x6A21;&#x6837;&#x672C;&#x9009;&#x53D6;&#x6709;&#x8BEF;&#xFF0C;&#x5982;&#x6837;&#x672C;&#x6570;&#x91CF;&#x592A;&#x5C11;&#xFF0C;&#x9009;&#x6837;&#x65B9;&#x6CD5;&#x9519;&#x8BEF;&#xFF0C;&#x6837;&#x672C;&#x6807;&#x7B7E;&#x9519;&#x8BEF;&#x7B49;&#xFF0C;&#x5BFC;&#x81F4;&#x9009;&#x53D6;&#x7684;&#x6837;&#x672C;&#x6570;&#x636E;&#x4E0D;&#x8DB3;&#x4EE5;&#x4EE3;&#x8868;&#x9884;&#x5B9A;&#x7684;&#x5206;&#x7C7B;&#x89C4;&#x5219;</p>
<p>&#x6837;&#x672C;&#x566A;&#x97F3;&#x5E72;&#x6270;&#x8FC7;&#x5927;&#xFF0C;&#x4F7F;&#x5F97;&#x673A;&#x5668;&#x5C06;&#x90E8;&#x5206;&#x566A;&#x97F3;&#x8BA4;&#x4E3A;&#x662F;&#x7279;&#x5F81;&#x4ECE;&#x800C;&#x6270;&#x4E71;&#x4E86;&#x9884;&#x8BBE;&#x7684;&#x5206;&#x7C7B;&#x89C4;&#x5219;</p>
<p>&#x5047;&#x8BBE;&#x7684;&#x6A21;&#x578B;&#x65E0;&#x6CD5;&#x5408;&#x7406;&#x5B58;&#x5728;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x5047;&#x8BBE;&#x6210;&#x7ACB;&#x7684;&#x6761;&#x4EF6;&#x5B9E;&#x9645;&#x5E76;&#x4E0D;&#x6210;&#x7ACB;</p>
<p>&#x53C2;&#x6570;&#x592A;&#x591A;&#xFF0C;&#x6A21;&#x578B;&#x590D;&#x6742;&#x5EA6;&#x8FC7;&#x9AD8;</p>
<p>&#x5BF9;&#x4E8E;&#x51B3;&#x7B56;&#x6811;&#x6A21;&#x578B;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x5176;&#x751F;&#x957F;&#x6CA1;&#x6709;&#x5408;&#x7406;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5176;&#x81EA;&#x7531;&#x751F;&#x957F;&#x6709;&#x53EF;&#x80FD;&#x4F7F;&#x8282;&#x70B9;&#x53EA;&#x5305;&#x542B;&#x5355;&#x7EAF;&#x7684;&#x4E8B;&#x4EF6;&#x6570;&#x636E;(event)&#x6216;&#x975E;&#x4E8B;&#x4EF6;&#x6570;&#x636E;(no event)&#xFF0C;&#x4F7F;&#x5176;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x5B8C;&#x7F8E;&#x5339;&#x914D;&#xFF08;&#x62DF;&#x5408;&#xFF09;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x65E0;&#x6CD5;&#x9002;&#x5E94;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x96C6;</p>
<p>&#x5BF9;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#xFF1A;a)&#x5BF9;&#x6837;&#x672C;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5206;&#x7C7B;&#x51B3;&#x7B56;&#x9762;&#x4E0D;&#x552F;&#x4E00;&#xFF0C;&#x968F;&#x7740;&#x5B66;&#x4E60;&#x7684;&#x8FDB;&#x884C;,&#xFF0C;BP&#x7B97;&#x6CD5;&#x4F7F;&#x6743;&#x503C;&#x53EF;&#x80FD;&#x6536;&#x655B;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x51B3;&#x7B56;&#x9762;&#xFF1B;b)&#x6743;&#x503C;&#x5B66;&#x4E60;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x8DB3;&#x591F;&#x591A;(Overtraining)&#xFF0C;&#x62DF;&#x5408;&#x4E86;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x566A;&#x58F0;&#x548C;&#x8BAD;&#x7EC3;&#x6837;&#x4F8B;&#x4E2D;&#x6CA1;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x7279;&#x5F81;</p>
<h3 id="&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;"><a href="#&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;" class="headerlink" title="&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;"></a>&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</h3><ol>
<li>&#x6B63;&#x5219;&#x5316;&#xFF08;Regularization&#xFF09;&#xFF08;L1&#x548C;L2&#xFF09;</li>
<li>&#x6570;&#x636E;&#x6269;&#x589E;&#xFF0C;&#x5373;&#x589E;&#x52A0;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x6837;&#x672C;</li>
<li>Dropout</li>
<li>Early stopping</li>
</ol>
<h3 id="&#x6B63;&#x5219;&#x5316;"><a href="#&#x6B63;&#x5219;&#x5316;" class="headerlink" title="&#x6B63;&#x5219;&#x5316;"></a>&#x6B63;&#x5219;&#x5316;</h3><p>&#x5728;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x964D;&#x4F4E; loss &#x4EE5;&#x8FBE;&#x5230;&#x63D0;&#x9AD8; accuracy &#x7684;&#x76EE;&#x7684;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x6B63;&#x5219;&#x5316;&#x4E4B;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x76F4;&#x63A5;&#x5C06;&#x6743;&#x503C;&#x7684;&#x5927;&#x5C0F;&#x52A0;&#x5165;&#x5230; loss &#x91CC;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x7684;&#x65F6;&#x5019;&#x9650;&#x5236;&#x6743;&#x503C;&#x53D8;&#x5927;&#x3002;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x964D;&#x4F4E;&#x6574;&#x4F53;&#x7684; loss&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x80FD;&#x964D;&#x4F4E;&#x5B9E;&#x9645;&#x8F93;&#x51FA;&#x4E0E;&#x6837;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x8BEF;&#x5DEE;&#xFF0C;&#x4E5F;&#x80FD;&#x964D;&#x4F4E;&#x6743;&#x503C;&#x5927;&#x5C0F;</p>
<p>&#x6B63;&#x5219;&#x5316;&#x65B9;&#x6CD5;&#x5305;&#x62EC; L0 &#x6B63;&#x5219;&#x3001; L1 &#x6B63;&#x5219;&#x548C; L2 &#x6B63;&#x5219;&#xFF0C;&#x800C;&#x6B63;&#x5219;&#x4E00;&#x822C;&#x662F;&#x5728;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4E4B;&#x540E;&#x52A0;&#x4E0A;&#x5BF9;&#x4E8E;&#x7684;&#x8303;&#x6570;&#x3002;&#x4F46;&#x662F;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x4E00;&#x822C;&#x4F7F;&#x7528; L2 &#x6B63;&#x5219;:</p>
<p><img src="/2018/05/11/%E8%BF%87%E6%8B%9F%E5%90%88%E5%92%8C%E6%AC%A0%E6%8B%9F%E5%90%88/clip_image002.png" alt="img"></p>
<p>L2&#x8303;&#x6570;&#x662F;&#x6307;&#x5411;&#x91CF;&#x5404;&#x5143;&#x7D20;&#x7684;&#x5E73;&#x65B9;&#x548C;&#x7136;&#x540E;&#x6C42;&#x5E73;&#x65B9;&#x6839;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97; W&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x5F88;&#x5C0F;&#xFF0C;&#x90FD;&#x63A5;&#x8FD1;&#x4E8E;0&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x8BA9;&#x5B83;&#x7B49;&#x4E8E;0&#xFF0C;&#x800C;&#x662F;&#x63A5;&#x8FD1;&#x4E8E;0&#x3002; L2&#x6B63;&#x5219;&#x9879;&#x8D77;&#x5230;&#x4F7F;&#x5F97;&#x53C2;&#x6570; W&#x53D8;&#x5C0F;&#x52A0;&#x5267;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5173;&#x4E8E;&#x5B83;&#x4E3A;&#x4EC0;&#x4E48;&#x80FD;&#x9632;&#x6B62;&#x8FC7;&#x62DF;&#x5408;&#x7B80;&#x7B54;&#x7684;&#x7406;&#x89E3;&#x4E3A;&#xFF1A;&#x66F4;&#x5C0F;&#x7684;&#x53C2;&#x6570;&#x503C;W&#x610F;&#x5473;&#x7740;&#x6A21;&#x578B;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x66F4;&#x4F4E;&#xFF0C;&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x62DF;&#x5408;&#x521A;&#x521A;&#x597D;&#xFF0C;&#x4E0D;&#x4F1A;&#x8FC7;&#x5206;&#x62DF;&#x5408;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5F97;&#x4E0D;&#x4F1A;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x6A21;&#x578B;&#x7684;&#x6CDB;&#x5316;&#x80FD;&#x529B;</p>
<h3 id="&#x6570;&#x636E;&#x589E;&#x5E7F;"><a href="#&#x6570;&#x636E;&#x589E;&#x5E7F;" class="headerlink" title="&#x6570;&#x636E;&#x589E;&#x5E7F;"></a>&#x6570;&#x636E;&#x589E;&#x5E7F;</h3><p>&#x8FD9;&#x662F;&#x89E3;&#x51B3;&#x8FC7;&#x62DF;&#x5408;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EA;&#x8981;&#x7ED9;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8BA9;&#x6A21;&#x578B;&#x300C;&#x770B;&#x89C1;&#x300D;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x300C;&#x4F8B;&#x5916;&#x60C5;&#x51B5;&#x300D;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x4E0D;&#x65AD;&#x4FEE;&#x6B63;&#x81EA;&#x5DF1;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x679C;</p>
<p>&#x5982;&#x4F55;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;</p>
<ol>
<li>&#x4ECE;&#x6570;&#x636E;&#x6E90;&#x5934;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x6570;&#x636E;</li>
<li>&#x6839;&#x636E;&#x5F53;&#x524D;&#x6570;&#x636E;&#x96C6;&#x4F30;&#x8BA1;&#x6570;&#x636E;&#x5206;&#x5E03;&#x53C2;&#x6570;&#xFF0C;&#x4F7F;&#x7528;&#x8BE5;&#x5206;&#x5E03;&#x4EA7;&#x751F;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF1A;&#x8FD9;&#x4E2A;&#x4E00;&#x822C;&#x4E0D;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x4F30;&#x8BA1;&#x5206;&#x5E03;&#x53C2;&#x6570;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x4F1A;&#x4EE3;&#x5165;&#x62BD;&#x6837;&#x8BEF;&#x5DEE;</li>
<li>&#x6570;&#x636E;&#x589E;&#x5F3A;&#xFF08;Data Augmentation&#xFF09;&#xFF1A;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x89C4;&#x5219;&#x6269;&#x5145;&#x6570;&#x636E;&#x3002;&#x5982;&#x5728;&#x7269;&#x4F53;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x91CC;&#xFF0C;&#x7269;&#x4F53;&#x5728;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3001;&#x59FF;&#x6001;&#x3001;&#x5C3A;&#x5EA6;&#xFF0C;&#x6574;&#x4F53;&#x56FE;&#x7247;&#x660E;&#x6697;&#x5EA6;&#x7B49;&#x90FD;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5206;&#x7C7B;&#x7ED3;&#x679C;&#x3002;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x56FE;&#x50CF;&#x5E73;&#x79FB;&#x3001;&#x7FFB;&#x8F6C;&#x3001;&#x7F29;&#x653E;&#x3001;&#x5207;&#x5272;&#x7B49;&#x624B;&#x6BB5;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x6210;&#x500D;&#x6269;&#x5145;</li>
</ol>
<h3 id="Dropout"><a href="#Dropout" class="headerlink" title="Dropout"></a>Dropout</h3><p>&#x5728;&#x8BAD;&#x7EC3;&#x65F6;&#xFF0C;&#x6BCF;&#x6B21;&#x968F;&#x673A;&#xFF08;&#x5982;50%&#x6982;&#x7387;&#xFF09;&#x5FFD;&#x7565;&#x9690;&#x5C42;&#x7684;&#x67D0;&#x4E9B;&#x8282;&#x70B9;&#xFF1B;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x76F8;&#x5F53;&#x4E8E;&#x968F;&#x673A;&#x4ECE; 2^n(n&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x7F51;&#x7EDC;) &#x4E2A;&#x6A21;&#x578B;&#x4E2D;&#x91C7;&#x6837;&#x9009;&#x62E9;&#x6A21;&#x578B;</p>
<h3 id="Early-stopping"><a href="#Early-stopping" class="headerlink" title="Early stopping"></a>Early stopping</h3><p>Early stopping&#x4FBF;&#x662F;&#x4E00;&#x79CD;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x622A;&#x65AD;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x9632;&#x6B62;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5373;&#x5728;&#x6A21;&#x578B;&#x5BF9;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x96C6;&#x8FED;&#x4EE3;&#x6536;&#x655B;&#x4E4B;&#x524D;&#x505C;&#x6B62;&#x8FED;&#x4EE3;&#x6765;&#x9632;&#x6B62;&#x8FC7;&#x62DF;&#x5408;</p>
<p>&#x5177;&#x4F53;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;Epoch&#x7ED3;&#x675F;&#x65F6;&#x8BA1;&#x7B97;validation data&#x7684;accuracy&#xFF0C;&#x5F53;accuracy&#x4E0D;&#x518D;&#x63D0;&#x9AD8;&#x65F6;&#xFF0C;&#x5C31;&#x505C;&#x6B62;&#x8BAD;&#x7EC3;&#x3002;&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x4F1A;&#x5728;accuracy&#x4E00;&#x964D;&#x4F4E;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x505C;&#x6B62;&#x8BAD;&#x7EC3;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x80FD;&#x7ECF;&#x8FC7;&#x8FD9;&#x4E2A;Epoch&#x540E;&#xFF0C;accuracy&#x964D;&#x4F4E;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x968F;&#x540E;&#x7684;Epoch&#x53C8;&#x8BA9;accuracy&#x53C8;&#x4E0A;&#x53BB;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x6839;&#x636E;&#x4E00;&#x4E24;&#x6B21;&#x7684;&#x8FDE;&#x7EED;&#x964D;&#x4F4E;&#x5C31;&#x5224;&#x65AD;&#x4E0D;&#x518D;&#x63D0;&#x9AD8;&#x3002;&#x4E00;&#x822C;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BB0;&#x5F55;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6700;&#x597D;&#x7684;validation accuracy&#xFF0C;&#x5F53;&#x8FDE;&#x7EED;10&#x6B21;Epoch&#xFF08;&#x6216;&#x8005;&#x66F4;&#x591A;&#x6B21;&#xFF09;&#x6CA1;&#x8FBE;&#x5230;&#x6700;&#x4F73;accuracy&#x65F6;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;accuracy&#x4E0D;&#x518D;&#x63D0;&#x9AD8;&#x4E86;&#x3002;&#x6B64;&#x65F6;&#x4FBF;&#x53EF;&#x4EE5;&#x505C;&#x6B62;&#x8FED;&#x4EE3;&#x4E86;&#xFF08;Early Stopping&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x4E5F;&#x79F0;&#x4E3A;&#x201C;No-improvement-in-n&#x201D;&#xFF0C;n&#x5373;Epoch&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x53D6;&#xFF0C;&#x5982;10&#x3001;20&#x3001;30&#x2026;&#x2026;</p>


                <hr>

                

                <ul class="pager">
                    
                        <li class="previous">
                            <a href="/2018/05/11/朴素贝叶斯/" data-toggle="tooltip" data-placement="top" title="朴素贝叶斯">&larr; Previous Post</a>
                        </li>
                    
                    
                        <li class="next">
                            <a href="/2017/06/02/决策树/" data-toggle="tooltip" data-placement="top" title="决策树">Next Post &rarr;</a>
                        </li>
                    
                </ul>

                

                
                <!-- disqus 评论框 start -->
                <div class="comment">
                    <div id="disqus_thread" class="disqus-thread"></div>
                </div>
                <!-- disqus 评论框 end -->
                

            </div>
        <!-- Tabe of Content -->
            <!-- Table of Contents -->

<aside id="sidebar">
    <div id="toc" class="toc-article">
        <strong class="toc-title">Contents</strong>
        
            <ol class="toc-nav"><li class="toc-nav-item toc-nav-level-1"><a class="toc-nav-link" href="#&#x8FC7;&#x62DF;&#x5408;&#x548C;&#x6B20;&#x62DF;&#x5408;"><span class="toc-nav-number">1.</span> <span class="toc-nav-text">&amp;#x8FC7;&amp;#x62DF;&amp;#x5408;&amp;#x548C;&amp;#x6B20;&amp;#x62DF;&amp;#x5408;</span></a><ol class="toc-nav-child"><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x6B20;&#x62DF;&#x5408;"><span class="toc-nav-number">1.1.</span> <span class="toc-nav-text">&amp;#x6B20;&amp;#x62DF;&amp;#x5408;</span></a></li><li class="toc-nav-item toc-nav-level-2"><a class="toc-nav-link" href="#&#x8FC7;&#x62DF;&#x5408;"><span class="toc-nav-number">1.2.</span> <span class="toc-nav-text">&amp;#x8FC7;&amp;#x62DF;&amp;#x5408;</span></a><ol class="toc-nav-child"><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;"><span class="toc-nav-number">1.2.1.</span> <span class="toc-nav-text">&amp;#x8FC7;&amp;#x62DF;&amp;#x5408;&amp;#x7684;&amp;#x89E3;&amp;#x51B3;&amp;#x65B9;&amp;#x6848;</span></a></li><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x6B63;&#x5219;&#x5316;"><span class="toc-nav-number">1.2.2.</span> <span class="toc-nav-text">&amp;#x6B63;&amp;#x5219;&amp;#x5316;</span></a></li><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#&#x6570;&#x636E;&#x589E;&#x5E7F;"><span class="toc-nav-number">1.2.3.</span> <span class="toc-nav-text">&amp;#x6570;&amp;#x636E;&amp;#x589E;&amp;#x5E7F;</span></a></li><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#Dropout"><span class="toc-nav-number">1.2.4.</span> <span class="toc-nav-text">Dropout</span></a></li><li class="toc-nav-item toc-nav-level-3"><a class="toc-nav-link" href="#Early-stopping"><span class="toc-nav-number">1.2.5.</span> <span class="toc-nav-text">Early stopping</span></a></li></ol></li></ol></li></ol>
        
    </div>
</aside>

            <!-- Side Catalog Container -->
        

    <!-- Sidebar Container -->

            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                
                <section>
                    <!-- no hr -->
                    <h5><a href="/tags/">FEATURED TAGS</a></h5>
                    <div class="tags">
                       
                          <a class="tag" href="/tags/#机器学习" title="机器学习">机器学习</a>
                        
                          <a class="tag" href="/tags/#深度学习" title="深度学习">深度学习</a>
                        
                    </div>
                </section>
                

                <!-- Friends Blog -->
                
                <hr>
                <h5>FRIENDS</h5>
                <ul class="list-inline">

                    
                        <li><a href="https://shitianming.github.io/" target="_blank">shitianming&#39;s Blog</a></li>
                    
                </ul>
                
            </div>

        </div>
    </div>
</article>




<!-- disqus 公共JS代码 start (一个网页只需插入一次) -->
<script type="text/javascript">
    /* * * CONFIGURATION VARIABLES * * */
    var disqus_shortname = "hexo-theme-huxblog";
    var disqus_identifier = "http://example.com/2018/05/11/%E8%BF%87%E6%8B%9F%E5%90%88%E5%92%8C%E6%AC%A0%E6%8B%9F%E5%90%88/";
    var disqus_url = "http://example.com/2018/05/11/%E8%BF%87%E6%8B%9F%E5%90%88%E5%92%8C%E6%AC%A0%E6%8B%9F%E5%90%88/";

    (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
</script>
<!-- disqus 公共JS代码 end -->




<!-- async load function -->
<script>


    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
    function IsPC() {
      var userAgentInfo = navigator.userAgent;
      var Agents = ["Android", "iPhone",
        "SymbianOS", "Windows Phone",
        "iPad", "iPod"];
      var flag = true;
      for (var v = 0; v < Agents.length; v++) {
        if (userAgentInfo.indexOf(Agents[v]) > 0) {
          flag = false;
          break;
        }
      }
      return flag;
    }
    setTimeout(()=> {
      if (!IsPC()) {
        var bignav = document.querySelector('.toc');//获取到导航栏id
        bignav.style.display = 'none';
        return
      }

      let tocText = document.getElementsByClassName('toc-nav-text')
      let arr = Array.prototype.slice.call(tocText)
      arr.forEach((item)=> {
        item.innerText = unescape(item.innerText.replace(/&#x/g,'%u').replace(/;/g,''))

      })

      var toc = document.getElementById('toc')

      if (toc != null) {
        window.addEventListener("scroll", scrollcatelogHandler);
        var tocPosition = toc.offsetTop;
        var height_header = $("#signature").height();
        function scrollcatelogHandler(e) {
          var event = e || window.event,
            target = event.target || event.srcElement;
          var scrollTop = document.documentElement.scrollTop || document.body.scrollTop;
          if (scrollTop >  tocPosition -60) {
            toc.classList.add("toc-fixed");
          } else {
            toc.classList.remove("toc-fixed");
          }
        }
      }


      //
      // window.onscroll= function(e){
      //   console.log(e)
      //   var topScroll = document.documentElement.scrollTop || document.body.scrollTop || window.pageYOffset || 0//滚动的距离,距离顶部的距离
      //
      //   var bignav = document.getElementById('#toc');//获取到导航栏id
      //   if(topScroll >= 532){
      //     //当滚动距离小于250的时候执行下面的内容，也就是让导航栏恢复原状
      //     bignav.style.position = 'fixed';
      //     bignav.style.top = '80px';
      //     bignav.style.right = '0';
      //   } else {
      //     bignav.style.position = 'absolute';
      //     bignav.style.top = '582px';
      //     bignav.style.right = '0';
      //   }
      //
      // }
      console.log(tocText)
    }, 0)

</script>
<!-- anchor-js, Doc:http://bryanbraun.github.io/anchorjs/ -->
<script>
    async("https://cdn.bootcss.com/anchor-js/1.1.1/anchor.min.js",function(){
        anchors.options = {
          visible: 'always',
          placement: 'right',
          icon: '#'
        };
        anchors.add().remove('.intro-header h1').remove('.subheading').remove('.sidebar-container h5');
    })
</script>
<style>
    /* place left on bigger screen */
    @media all and (min-width: 800px) {
        .anchorjs-link{
            position: absolute;

        }
    }
    .post-toc {
        position: absolute;
        top: 582px;
        right: 0;
    }
    .post-toc-child {
        min-width: 240px;
    }

</style>



    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                
                    <li>
                        <a target="_blank" href="https://www.zhihu.com/people/gao-ming-40-81">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa  fa-stack-1x fa-inverse">知</i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank" href="http://weibo.com/u/3874944289">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-weibo fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                

                
                    <li>
                        <a target="_blank"  href="https://github.com/gaoming95">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-github fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                
                    <li>
                        <a target="_blank"  href="https://www.linkedin.com/in/明-高-7570aa105">
                            <span class="fa-stack fa-lg">
                                <i class="fa fa-circle fa-stack-2x"></i>
                                <i class="fa fa-linkedin fa-stack-1x fa-inverse"></i>
                            </span>
                        </a>
                    </li>
                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; Gao Ming’s Blog 2022 
                    <br>
					<!--
                    Theme by <a target="_blank" rel="noopener" href="http://huangxuan.me">Hux</a> 
                    <span style="display: inline-block; margin: 0 5px;">
                        <i class="fa fa-heart"></i>
                    </span> 
                    Ported by <a target="_blank" rel="noopener" href="http://blog.kaijun.rocks">Kaijun</a> | 
                    <iframe
                        style="margin-left: 2px; margin-bottom:-5px;"
                        frameborder="0" scrolling="0" width="91px" height="20px"
                        src="https://ghbtns.com/github-btn.html?user=kaijun&repo=hexo-theme-huxblog&type=star&count=true" >
                    </iframe>
					-->
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->

<script src="/js/jquery.min.js"></script>


<!-- Bootstrap Core JavaScript -->

<script src="/js/bootstrap.min.js"></script>


<!-- Custom Theme JavaScript -->

<script src="/js/hux-blog.min.js"></script>



<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>

<!-- 
     Because of the native support for backtick-style fenced code blocks 
     right within the Markdown is landed in Github Pages, 
     From V1.6, There is no need for Highlight.js, 
     so Huxblog drops it officially.

     - https://github.com/blog/2100-github-pages-now-faster-and-simpler-with-jekyll-3-0  
     - https://help.github.com/articles/creating-and-highlighting-code-blocks/    
-->
<!--
    <script>
        async("http://cdn.bootcss.com/highlight.js/8.6/highlight.min.js", function(){
            hljs.initHighlightingOnLoad();
        })
    </script>
    <link href="http://cdn.bootcss.com/highlight.js/8.6/styles/github.min.css" rel="stylesheet">
-->


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("http://example.com/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("https://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->




<!-- Baidu Tongji -->

<script>
    // dynamic User by Hux
    var _baId = '87fec1e5b2bb914ad19c5ba8ca638aad';

    // Originial
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?" + _baId;
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
</script>


<!-- Side Catalog -->




</body>

</html>
